// СтоимостьВозвратаПродавцуApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый СтоимостьВозвратаПродавцуApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Тарифы на возврат
//
// Метод возвращает [тарифы](https://seller.wildberries.ru/dynamic-product-categories/return-cost):
// - на перевозку товаров со склада WB или из пункта приёма до продавца
// - на обратную перевозку возвратов, которые не забрал продавец
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Сервисный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   date - Строка - Дата в формате ГГГГ-ММ-ДД
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1TariffsReturn(Знач date) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("date", date);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/tariffs/return",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://common-api.wildberries.ru");

КонецФункции

