// ТарифыНаОстатокApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ТарифыНаОстатокApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Тарифы для коробов
//
// Для остатков товаров, которые поставляются на склад в коробах, метод возвращает [тарифы](https://seller.wildberries.ru/dynamic-product-categories) на:
// - доставку со склада или пункта приёма до покупателя
// - доставку от покупателя до пункта приёма
// - хранение на складе WB
//
// Тарифы для коробов совпадают с тарифами для **Суперсейфа**
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Сервисный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   date - Строка - Дата в формате ГГГГ-ММ-ДД
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1TariffsBox(Знач date) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("date", date);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/tariffs/box",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://common-api.wildberries.ru");

КонецФункции

// Тарифы для монопаллет
//
// Для товаров, которые поставляются на склад WB на монопаллетах, метод возвращает [стоимость](https://seller.wildberries.ru/dynamic-product-categories):
// - доставки со склада до покупателя
// - доставки от покупателя до склада
// - хранения на складе WB
//
// Тарифы для монопаллет совпадают с тарифами для **Поштучных паллет**
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Сервисный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   date - Строка - Дата в формате ГГГГ-ММ-ДД
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1TariffsPallet(Знач date) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("date", date);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/tariffs/pallet",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://common-api.wildberries.ru");

КонецФункции

