// ТарифыНаПоставкуApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ТарифыНаПоставкуApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Тарифы на поставку
//
// Метод [временно отключён](https://dev.wildberries.ru/release-notes?id=570)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Сервисный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый с секретом | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * warehouseIDs - Строка - ID складов. По умолчанию возвращаются данные по всем складам
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AcceptanceCoefficients(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/tariffs/v1/acceptance/coefficients",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://common-api.wildberries.ru");

КонецФункции

