// КампанииApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый КампанииApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Списки кампаний
//
// Метод возвращает списки всех [рекламных кампаний](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) продавца с их ID. Кампании сгруппированы по типу и статусу, у каждой указана дата последнего изменения.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PromotionCount() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/promotion/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Информация о кампаниях
//
// Метод возвращает информацию о рекламных кампаниях с единой или ручной ставкой по их статусам, типам оплаты и ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * ids - Строка - ID кампаний, максимум 50
//    * statuses - Строка - Статусы кампаний: - `-1` — удалена, процесс удаления будет завершён в течение 10 минут - `4` — готова к запуску - `7` — завершена - `8` — отменена - `9` — актив…
//    * payment_type - Строка - Тип оплаты: - `cpm` — за показы - `cpc` — за клик
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2Adverts(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/advert/v2/adverts",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

