// КалендарьАкцийApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый КалендарьАкцийApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Список акций
//
// Метод возвращает список [акций](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/getV1CalendarPromotionsDetails) в WB с датами и временем проведения.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Календарь акций**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   startDateTime - Дата - Начало периода, формат `YYYY-MM-DDTHH:MM:SSZ`
//   endDateTime - Дата - Конец периода, формат `YYYY-MM-DDTHH:MM:SSZ`
//   allPromo - Булево - Показать акции: - `false` — доступные для участия - `true` — все акции
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество запрашиваемых акций
//    * offset - Число - После какого элемента выдавать данные
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1CalendarPromotions(Знач startDateTime, Знач endDateTime, Знач allPromo, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("startDateTime", startDateTime);
	ПараметрыЗапроса.Вставить("endDateTime", endDateTime);
	ПараметрыЗапроса.Вставить("allPromo", allPromo);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/calendar/promotions",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://dp-calendar-api.wildberries.ru");

КонецФункции

// Детальная информация об акциях
//
// Метод возвращает подробную информацию об [акции](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/getV1CalendarPromotionsDetails) по ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Календарь акций**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   promotionIDs - Массив - ID акций, по которым нужно вернуть информацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1CalendarPromotionsDetails(Знач promotionIDs) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("promotionIDs", promotionIDs);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/calendar/promotions/details",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://dp-calendar-api.wildberries.ru");

КонецФункции

// Список товаров для участия в акции
//
// Метод формирует список товаров, подходящих для участия в [акции](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/getV1CalendarPromotionsDetails). Эти товары можно добавить в акцию с помощью [отдельного метода](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/postV1CalendarPromotionsUpload).
//
// Данный метод неприменим для автоакций.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Календарь акций**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 6 сек | 10 запросов | 600 мс | 5 запросов |
//
// Параметры:
//   promotionID - Число - ID акции
//   inAction - Булево - Участвует в акции: - `true` — да - `false` — нет
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество запрашиваемых товаров
//    * offset - Число - После какого элемента выдавать данные
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1CalendarPromotionsNomenclatures(Знач promotionID, Знач inAction, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("promotionID", promotionID);
	ПараметрыЗапроса.Вставить("inAction", inAction);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/calendar/promotions/nomenclatures",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://dp-calendar-api.wildberries.ru");

КонецФункции

// Добавить товар в акцию
//
// Метод создаёт задание на загрузку товара в [акцию](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/getV1CalendarPromotionsDetails).
// Состояние загрузки можно проверить с помощью [отдельных методов](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryTasks).
//
// Данный метод неприменим для автоакций.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Календарь акций**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - PromotionPostV1CalendarPromotionsUploadRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1CalendarPromotionsUpload(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/calendar/promotions/upload",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://dp-calendar-api.wildberries.ru");

КонецФункции

