// МедиаApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый МедиаApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Информация о медиакампании
//
// Метод возвращает информацию о кампании [WB Медиа](https://cmp.wildberries.ru/cmpf/list). Вместо карточек товаров в медиакампаниях продвигаются рекламные баннеры продавца на сайте и в приложении WB.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Сервисный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID медиакампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Advert(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/advert",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-media-api.wildberries.ru");

КонецФункции

// Список медиакампаний
//
// Метод возвращает список всех [медиакампаний](https://dev.wildberries.ru/openapi/promotion#tag/media/operation/getV1Advert) продавца по их типам и статусам.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Сервисный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * status - Строка - Статус медиакампании: - `1` — черновик - `2` — модерация - `3` — отклонена (с возможностью вернуть на модерацию) - `4` — готова к запуску - `5` — запланирована…
//    * type - Число - Тип медиакампании: - `1` — размещение по дням - `2` — размещение по просмотрам
//    * limit - Число - Количество кампаний в ответе
//    * offset - Число - Смещение относительно первой медиакампании
//    * order - Строка - Порядок вывода ответа: - `create` — по времени создания медиакампании - `id` — по ID медиакампании
//    * direction - Строка - Порядок сортировки: - `desc` — от большего к меньшему - `asc` — от меньшего к большему
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Adverts(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/adverts",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-media-api.wildberries.ru");

КонецФункции

// Количество медиакампаний
//
// Метод возвращает количество [медиакампаний](https://dev.wildberries.ru/openapi/promotion#tag/media/operation/getV1Advert) продавца с группировкой по статусам.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Сервисный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Count() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-media-api.wildberries.ru");

КонецФункции

