// ПоисковыеКластерыApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ПоисковыеКластерыApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Удалить ставки поисковых кластеров
//
// Метод удаляет ставки с поисковых кластеров.
// Можно использовать только для кампаний с:
// - ручной ставкой
// - моделью оплаты `cpm` — за показы
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0DeleteNormQueryBidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV0NormqueryBids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		"/adv/v0/normquery/bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Установить ставки для поисковых кластеров
//
// Метод устанавливает ставки в рублях на поисковые кластеры.
// Можно использовать только для кампаний с:
// - ручной ставкой
// - моделью оплаты `cpm` — за показы
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 2 запроса | 500 мс | 4 запроса |
// | Сервисный | 1 сек | 2 запроса | 500 мс | 4 запроса |
// | Базовый с секретом | 1 сек | 2 запроса | 500 мс | 4 запроса |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0SetNormQueryBidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryBids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Список ставок поисковых кластеров
//
// Метод возвращает список поисковых кластеров со ставками по:
// - ID кампаний
// - артикулам WB
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0GetNormQueryBidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryGetBids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/get-bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Список минус-фраз кампаний
//
// Метод возвращает список минус-фраз по:
// - ID кампаний
// - артикулам WB
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0GetNormQueryMinusRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryGetMinus(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/get-minus",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Списки активных и неактивных поисковых кластеров
//
// Метод возвращает списки активных и неактивных поисковых кластеров, по которым было не меньше 100 показов.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0GetNormQueryListRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryList(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/list",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Установка и удаление минус-фраз
//
// Метод устанавливает и удаляет минус-фразы в кампаниях c единой и ручной ставкой.
//
// Отправка пустого массива удаляет все минус-фразы
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0SetMinusNormQueryRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormquerySetMinus(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/set-minus",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Установить ставки для поисковых кластеров в валюте аккаунта продавца
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод устанавливает ставки на поисковые кластеры в валюте [аккаунта продавца](https://cmp.wildberries.ru/campaigns/finances).
// Можно использовать только для кампаний c ручной ставкой и моделью оплаты `cpm` — за показы.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 2 запроса | 500 мс | 4 запроса |
// | Сервисный | 1 сек | 2 запроса | 500 мс | 4 запроса |
//
// Параметры:
//   Тело - PromotionV1SetNormQueryBidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1NormqueryBids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/advert/v1/normquery/bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

