// СтатистикаApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый СтатистикаApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Статистика кампаний
//
// Метод формирует статистику для кампаний независимо от типа.
//
// Максимальный период в запросе — 31 день.
//
// Для кампаний в статусах `7`, `9` и `11`.
//
// В песочнице статистика кампаний доступна за последние 30 дней. Генерируется только для компаний в статусе `9`, тип `8`, 9 раз в сутки
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 1 запрос |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 1 запрос |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 1 запрос |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ids - Строка - ID кампаний, максимум 50 значений
//   beginDate - Дата - Дата начала интервала
//   endDate - Дата - Дата окончания интервала
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3Fullstats(Знач ids, Знач beginDate, Знач endDate) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("ids", ids);
	ПараметрыЗапроса.Вставить("beginDate", beginDate);
	ПараметрыЗапроса.Вставить("endDate", endDate);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v3/fullstats",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Статистика поисковых кластеров
//
// Метод формирует статистику по поисковым кластерам за указанный период.
// Можно использовать для кампаний с моделями оплаты `cpm` — за показы и `cpc` — за клики.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Сервисный | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Базовый с секретом | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0GetNormQueryStatsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryStats(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/stats",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Статистика по поисковым кластерам с детализацией по дням
//
// Метод формирует статистику по поисковым кластерам за указанный период с детализацией по дням.
// Можно использовать для кампаний с моделями оплаты `cpm` — за показы и `cpc` — за клики.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Сервисный | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Базовый с секретом | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV1GetNormQueryStatsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1NormqueryStats(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v1/normquery/stats",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Статистика медиакампаний
//
// Метод формирует статистику кампаний сервиса [WB Медиа](https://cmp.wildberries.ru/cmpf/statistics). Статистику можно группировать по датам и/или интервалам.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Сервисный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - Массив
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1Stats(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v1/stats",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-media-api.wildberries.ru");

КонецФункции

