// УправлениеКампаниямиApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый УправлениеКампаниямиApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Рекомендуемые ставки для карточек товаров и поисковых кластеров
//
// Метод возвращает рекомендуемые ставки для карточек товаров и поисковых кластеров кампании.
// Можно использовать для кампаний с типами оплаты `cpm` — за показы и `cpc` — за клики.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Сервисный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Базовый | 1 ч | 20 запросов | 3 мин | 1 запрос |
//
// Параметры:
//   nmId - Число - Артикул WB
//   advertId - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0BidsRecommendations(Знач nmId, Знач advertId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("nmId", nmId);
	ПараметрыЗапроса.Вставить("advertId", advertId);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/advert/v0/bids/recommendations",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Получить настройки дневных лимитов кампаний
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод возвращает текущие настройки [дневных лимитов кампаний CPC](https://cmp.wildberries.ru/campaigns/help/knowledge-base/options#%D0%94%D0%BD%D0%B5%D0%B2%D0%BD%D0%BE%D0%B9%D0%BB%D0%B8%D0%BC%D0%B8%D1%82%D0%B2%D0%BA%D0%B0%D0%BC%D0%BF%D0%B0%D0%BD%D0%B8%D1%8F%D1%85%D1%81%D0%BE%D0%BF%D0%BB%D0%B0%D1%82%D0%BE%D0%B9%D0%B7%D0%B0%D0%BA%D0%BB%D0%B8%D0%BA%D0%B8%D0%A1%D0%A0%D0%A1) — максимальных сумм, которые кампании могут потратить на продвижение в течение суток.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Сервисный | 1 мин | 5 запросов | 12 сек | 5 запросов |
//
// Параметры:
//   advertIds - Строка - ID кампаний, максимум 100. Укажите значения через запятую
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0DailyLimits(Знач advertIds) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("advertIds", advertIds);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/advert/v0/daily-limits",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Удаление кампании
//
// Метод удаляет [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) в статусе `4` — готова к запуску.
//
// После удаления кампания некоторое время будет находиться в статусе `-1` — кампания в процессе удаления. Полное удаление кампании занимает от 3 до 10 минут.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0Delete(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v0/delete",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Пауза кампании
//
// Метод ставит [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) в статусе `9` — активна — на паузу.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0Pause(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v0/pause",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Запуск кампании
//
// Метод запускает [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) в статусах `4` — готово к запуску — или `11` — пауза.
// Чтобы запустить кампанию, проверьте ее бюджет. Если бюджета недостаточно, [пополните его](https://dev.wildberries.ru/openapi/promotion#tag/finances/operation/postV1BudgetDeposit).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0Start(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v0/start",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Завершение кампании
//
// Метод завершает [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) в статусах:
// - `9` — активна
// - `11` — пауза
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0Stop(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v0/stop",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Конфигурационные значения продвижения
//
// Метод возвращает валюту, код валюты [аккаунта продавца](https://cmp.wildberries.ru/campaigns/finances) и допустимые шаги ставок для метода [POST /api/advert/v1/normquery/bids](https://dev.wildberries.ru/openapi/promotion#tag/searchClusters/operation/postV1NormqueryBids)
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 1 запрос | 1 мин | 10 запросов |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Config() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/advert/v1/config",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Изменение списка карточек товаров в кампаниях
//
// Метод добавляет и удаляет карточки товаров в кампаниях.
//
// Для кампаний в статусах `4`, `9` и `11`.
//
// Для добавляемых товаров устанавливается текущая минимальная ставка.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPatchV0AuctionNmsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV0AuctionNms(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/adv/v0/auction/nms",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Изменение ставок в кампаниях
//
// Метод меняет ставки карточек товаров по артикулам WB в кампаниях:
// - с единой ставкой
// - с ручной ставкой
// - с моделью оплаты `cpc` — за клики
// Для кампаний в статусах `4`, `9` и `11`.
//
// В запросе укажите место размещения в параметре `placement`:
// - `combined` — в поиске и рекомендациях для кампаний с единой ставкой
// - `search `или `recommendations` — в поиске или рекомендациях для кампаний с ручной ставкой
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPatchV1BidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV1Bids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/advert/v1/bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Переименование кампании
//
// Метод меняет название [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts). Это можно сделать в любой момент существования кампании.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPostV0RenameRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0Rename(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/rename",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Изменение мест размещения в кампаниях с ручной ставкой
//
// Метод меняет места размещения в кампаниях с ручной ставкой и моделью оплаты за показы — `cpm`.
//
// Для кампаний в статусах `4`, `9` и `11`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPutV0AuctionPlacementsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PutV0AuctionPlacements(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PUT",
		"/adv/v0/auction/placements",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Настройка дневных лимитов кампаний
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод включает, выключает и обновляет дневной лимит кампаний.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Сервисный | 1 мин | 5 запросов | 12 сек | 5 запросов |
//
// Параметры:
//   Тело - PromotionV0PutDailyLimitsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PutV0DailyLimits(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PUT",
		"/api/advert/v0/daily-limits",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

