// ФинансыApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ФинансыApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Баланс
//
// Метод возвращает информацию о:
// - счёте кабинета Продвижения WB. Его пополняет продавец.
// - балансе — максимальной сумме для оплаты кампании по взаиморасчету: удержании средств из будущих продаж. Баланс пополнить нельзя, он рассчитывается автоматически на основе отчётов по продвижению.
// - бонусных начислениях WB.
// Чтобы получить информацию о бюджетах кампаний, используйте метод [Бюджеты кампаний](https://dev.wildberries.ru/openapi/promotion#tag/finances/operation/postV2Budget).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Balance() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/balance",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Бюджет кампании
//
// Метод будет отключен [16 ноября](https://dev.wildberries.ru/release-notes?id=582).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 4 запроса | 250 мс | 4 запроса |
// | Сервисный | 1 сек | 4 запроса | 250 мс | 4 запроса |
// | Базовый с секретом | 1 сек | 4 запроса | 250 мс | 4 запроса |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Budget(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/budget",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Получение истории пополнений счёта
//
// Метод возвращает историю пополнений счёта \\*\\*WB Продвижение\\*\\* за заданный период.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * from - Дата - Начало интервала
//    * to - Дата - Конец интервала. (Минимальный интервал 1 день, максимальный 31)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Payments(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/payments",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Получение истории затрат
//
// Метод формирует список фактических затрат на рекламные кампании за заданный период.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   from - Дата - Начало интервала
//   _to - Дата - Конец интервала. (Минимальный интервал 1 день, максимальный 31)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Upd(Знач from, Знач _to) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("from", from);
	ПараметрыЗапроса.Вставить("to", _to);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/upd",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Пополнение бюджета кампании
//
// Метод пополняет [бюджет](https://dev.wildberries.ru/openapi/promotion#tag/finances/operation/postV2Budget) кампании.
// Чтобы запустить кампанию после пополнения бюджета, используйте метод [Запуск кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaignManagement/operation/getV0Start).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//   Тело - PromotionPostV1BudgetDepositRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1BudgetDeposit(Знач id, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v1/budget/deposit",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Остатки бюджетов кампаний
//
// Метод возвращает информацию об остатках бюджетов [кампаний](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts).
// Для кампаний в [статусах](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV1PromotionCount):
// - `4` — готова к запуску
// - `9` — активна
// - `11` — на паузе
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 20 запросов | 3 сек | 4 запроса |
// | Сервисный | 1 мин | 20 запросов | 3 сек | 4 запроса |
// | Базовый с секретом | 1 мин | 20 запросов | 3 сек | 4 запроса |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV2BudgetRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2Budget(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/advert/v2/budget",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

