// ИнформацияДляФормированияПоставокApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ИнформацияДляФормированияПоставокApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Транзитные направления
//
// Метод [временно отключён](https://dev.wildberries.ru/release-notes?id=570)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 6 запросов | 10 сек | 10 запросов |
// | Сервисный | 1 мин | 6 запросов | 10 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 6 запросов | 10 сек | 10 запросов |
// | Базовый | 12 ч | 1 запрос | 12 ч | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1TransitTariffs() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/transit-tariffs",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Список складов
//
// Метод [временно отключён](https://dev.wildberries.ru/release-notes?id=570)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Сервисный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый с секретом | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый | 12 ч | 1 запрос | 12 ч | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов.
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Warehouses() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/warehouses",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Опции приёмки
//
// Метод [временно отключён](https://dev.wildberries.ru/release-notes?id=570)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Сервисный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый с секретом | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов.
//
// Параметры:
//   Тело - Массив
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * warehouseID - Число - ID склада. Если параметр не указан, возвращаются данные по всем складам. \\*\\*Максимум одно значение\\*\\*
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1AcceptanceOptions(Знач Тело, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/acceptance/options",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://supplies-api.wildberries.ru");

КонецФункции

