// ИнформацияОПоставкахApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ИнформацияОПоставкахApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Детали поставки
//
// Метод возвращает детали поставки по ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Сервисный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   ID - Число - ID поставки или заказа
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * isPreorderID - Булево - Поиск по: - `true` — ID заказа, если в `ID` передаёте ID заказа - `false` — ID поставки, если в `ID` передаёте ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SuppliesId(Знач ID, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/supplies/%1", Транспорт.ЭкранироватьСегмент(ID)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Товары поставки
//
// Метод возвращает информацию о товарах в поставке.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Сервисный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   ID - Число - ID поставки или заказа
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество записей в ответе
//    * offset - Число - После какого элемента выдавать данные
//    * isPreorderID - Булево - Поиск по: - `true` — ID заказа, если в `ID` передаёте ID заказа - `false` — ID поставки, если в `ID` передаёте ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SuppliesIdGoods(Знач ID, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/supplies/%1/goods", Транспорт.ЭкранироватьСегмент(ID)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Упаковка поставки
//
// Метод возвращает информацию об упаковке поставки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Сервисный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   ID - Число - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SuppliesIdPackage(Знач ID) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/supplies/%1/package", Транспорт.ЭкранироватьСегмент(ID)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Расхождения в поставке
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод возвращает информацию о выявленных расхождениях между заявленным и фактическим количеством товара в поставке.
//
// Для поставок принятых не позднее года назад.
//
// \\*\\*Типы расхождений:\\*\\*
//
// Расхождение в большую сторону:
//
// 1. Избыток товара с заявленным баркодом:
// - `\"discrepancyType\": \"surplus\"`
// - `\"discrepancyLabel\": \"surplus\"`
// 2. Избыток товара с несоответствующим заявленному баркодом:
// - `\"discrepancyType\": \"surplus\"`
// - `\"discrepancyLabel\": \"re-sorting\"`
// Расхождение в меньшую сторону:
//
// 1. Не хватает товара:
// - `\"discrepancyType\": \"shortage\"`
// - `\"discrepancyLabel\": \"shortage\"`
// 2. Некоторые баркоды не соответствуют заявленным:
// - `\"discrepancyType\": \"shortage\"`
// - `\"discrepancyLabel\": \"re-sorting\"`
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 1 запрос | 1 мин | 1 запрос |
//
// Параметры:
//   supplyId - Число - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SuppliesSupplyIdDiscrepanciesQuantity(Знач supplyId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/supplies/v1/discrepancies/%1", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Список поставок
//
// Метод возвращает список поставок, по умолчанию — последние 1000 поставок.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Сервисный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - OrdersFbwModelsSuppliesFiltersRequest
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество записей в ответе
//    * offset - Число - После какого элемента выдавать данные
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1Supplies(Знач Тело, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/supplies",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://supplies-api.wildberries.ru");

КонецФункции

