// ЧерновикиПоставокApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ЧерновикиПоставокApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Удалить черновик
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод удаляет черновик поставки по его ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   draftId - Строка - ID черновика
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV1DraftsDraftId(Знач draftId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		СтрШаблон("/api/supplies/v1/drafts/%1", Транспорт.ЭкранироватьСегмент(draftId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Удалить товары из черновика
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод удаляет товары из черновика поставки по списку баркодов.
//
// Баркоды не валидируются. Если в запросе вы передали некорректные баркоды, вы не получите ошибку. При этом корректные баркоды будут удалены из черновика.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   draftId - Строка - ID черновика
//   Тело - OrdersFbwModelsDraftDeleteitemsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV1DraftsDraftIdItems(Знач draftId, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		СтрШаблон("/api/supplies/v1/drafts/%1/items", Транспорт.ЭкранироватьСегмент(draftId)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Список черновиков
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод возвращает список черновиков поставок.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество черновиков в ответе
//    * offset - Число - Сколько элементов пропустить. Например, для значения 10 ответ начнется с 11 элемента
//    * sort - Строка - Сортировка: - `createdDt` — по дате создания черновика - `updatedDt` — по дате обновления черновика
//    * order - Строка - Порядок выдачи: - `desc` — по убыванию - `asc` — по возрастанию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Drafts(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/supplies/v1/drafts",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Список товаров в черновике
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод возвращает список товаров черновика.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   draftId - Строка - ID черновика
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1DraftsDraftIdItems(Знач draftId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/supplies/v1/drafts/%1/items", Транспорт.ЭкранироватьСегмент(draftId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Создать черновик
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод создаёт пустой черновик поставки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1Drafts() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/supplies/v1/drafts",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Добавить товары в черновик
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод добавляет товары в черновик поставки.
//
// Метод работает по принципу атомарности:
// - если все баркоды прошли валидацию успешно, то все товары добавятся в черновик. В ответе вернётся `{\"results\":[]}`
// - если хотя бы один баркод не прошел валидацию, ни один товар в черновик не добавится. В ответе вернётся список невалидных баркодов
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   draftId - Строка - ID черновика
//   Тело - OrdersFbwModelsDraftAdditemsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1DraftsDraftIdItems(Знач draftId, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		СтрШаблон("/api/supplies/v1/drafts/%1/items", Транспорт.ЭкранироватьСегмент(draftId)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://supplies-api.wildberries.ru");

КонецФункции

