// ПоставкиFBSApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ПоставкиFBSApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Удалить поставку
//
// Метод удаляет [поставку](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/getV3SuppliesSupplyId), если она активна и за ней не закреплено ни одно [сборочное задание](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV3SuppliesSupplyId(Знач supplyId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		СтрШаблон("/api/v3/supplies/%1", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Удалить грузоместа из поставки
//
// Метод удаляет грузоместа из поставки.
//
// Можно удалить только пока поставка на сборке.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//   Тело - OrdersFbsDeleteV3SuppliesSupplyIdTrbxRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV3SuppliesSupplyIdTrbx(Знач supplyId, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		СтрШаблон("/api/v3/supplies/%1/trbx", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить список стран ОКСМ
//
// Метод возвращает список стран ОКСМ — Общероссийского классификатора стран мира — с полными названиями и кодами.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3FbsDictionariesCountriesOksm() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/marketplace/v3/fbs/dictionaries/countries/oksm",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить список пунктов отгрузки поставок
//
// Метод возвращает доступные пункты отгрузки поставок с фильтрами:
// - по населённым пунктам России
// - по типам товаров, которые принимает пункт отгрузки
// Используйте данные из этого метода, чтобы устанавливать [параметры отгрузки поставок](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/patchV3FbsSuppliesShippingMethod).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   city - Строка - Населённый пункт отгрузки поставки, кириллица
//   cargoType - Число - Тип товара, который принимает пункт отгрузки: - `1` — малогабаритный товар (МГТ) - `2` — сверхгабаритный товар (СГТ) - `3` — крупногабаритный товар (КГТ+)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3FbsShippingPoints(Знач city, Знач cargoType) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("city", city);
	ПараметрыЗапроса.Вставить("cargoType", cargoType);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/marketplace/v3/fbs/shipping-points",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить QR-код СПОТ
//
// Метод возвращает сформированный QR-код СПОТ для поставки в формате PNG, кодировка base64.
// Вы можете получить QR-код, когда в методе [получения данных СПОТ](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/postV3FbsSuppliesSpotList) будет признак `\"status\":\"completed\"`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   supplyId - Строка - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3FbsSuppliesSupplyIdStickersSpot(Знач supplyId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/marketplace/v3/fbs/supplies/%1/stickers/spot", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить список поставок
//
// Метод возвращает список [поставок](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/getV3SuppliesSupplyId).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   limit - Число - Параметр пагинации. Устанавливает предельное количество возвращаемых данных.
//   next - Число - Параметр пагинации. Устанавливает значение, с которого надо получить следующий пакет данных. Для получения полного списка данных должен быть равен `0` в первом…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3Supplies(Знач limit, Знач next) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("limit", limit);
	ПараметрыЗапроса.Вставить("next", next);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v3/supplies",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить информацию о поставке
//
// Метод возвращает подробную информацию о поставке.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3SuppliesSupplyId(Знач supplyId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v3/supplies/%1", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить QR-код поставки
//
// Метод возвращает QR-код [поставки](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/getV3SuppliesSupplyId) в форматах:
// - SVG
// - ZPLV (вертикальный)
// - ZPLH (горизонтальный)
// - PNG
// QR-код поставки можно получить, только если поставка [передана в доставку](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/patchV3SuppliesSupplyIdDeliver).
//
// Размер — 580x400 px.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//   type - Строка - Тип стикера
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3SuppliesSupplyIdBarcode(Знач supplyId, Знач type) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("type", type);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v3/supplies/%1/barcode", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить ID сборочных заданий поставки
//
// Метод возвращает список ID сборочных заданий, закреплённых за поставкой.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3SuppliesSupplyIdOrderIds(Знач supplyId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/marketplace/v3/supplies/%1/order-ids", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить список грузомест поставки
//
// Возвращает список грузомест поставки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3SuppliesSupplyIdTrbx(Знач supplyId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v3/supplies/%1/trbx", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Установить параметры отгрузки поставок
//
// Метод устанавливает способ доставки, дату и пункт отгрузки у поставок.
//
// Для доставки транспортной компанией `\"shippingType\":\"transportCompany\"` укажите ID ЭТрН — электронной транспортной накладной — с помощью метода установки [ID ЭТрН поставки](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/patchV3FbsSuppliesWaybill).
//
// Добавленный к поставке ID ЭТрН сбрасывается, если поменять способ доставки `\"shippingType\":\"transportCompany\"` на `selfShipping`. Если вы хотите изменить способ доставки обратно на `transportCompany`, [добавьте ID ЭТрН](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/patchV3FbsSuppliesWaybill) заново.
//
// Параметры отгрузки нужно указать до передачи поставки в доставку. Вы можете обновлять параметры отгрузки до сканирования поставки и её коробов в пункте отгрузки. Когда поставка будет отсканирована, метод начнёт возвращать ошибку `409`.
//
// В запросе можно указать максимум 100 поставок. Результат обработки возвращается для каждой поставки отдельно.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   Тело - OrdersFbsPatchV3FbsSuppliesShippingMethodRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV3FbsSuppliesShippingMethod(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/marketplace/v3/fbs/supplies/shipping-method",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Установить ID ЭТрН поставок
//
// Метод устанавливает ID ЭТрН — электронной транспортной накладной. Чтобы использовать метод, укажите [место отгрузки поставки](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/patchV3FbsSuppliesShippingMethod) со способом доставки `\"shippingType\":\"transportCompany\"`.
//
// ID ЭТрН нужно указать до передачи поставки в доставку. Вы можете обновлять ID ЭТрН до сканирования поставки и её коробов в пункте отгрузки. Когда поставка будет отсканирована, метод начнёт возвращать ошибку `409`.
//
// В запросе можно указать максимум 100 поставок. Результат обработки возвращается для каждой поставки отдельно.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   Тело - OrdersFbsPatchV3FbsSuppliesWaybillRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV3FbsSuppliesWaybill(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/marketplace/v3/fbs/supplies/waybill",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Передать поставку в доставку
//
// Метод закрывает [поставку](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/getV3SuppliesSupplyId) и переводит все [сборочные задания](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders) в ней в [статус](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/postV3OrdersStatus) `complete` — в доставке. После закрытия поставки добавить новые сборочные задания к ней нельзя.
//
// Если поставка не была передана в доставку, то при приёмке первого товара поставка автоматически закроется.
//
// Передать поставку в доставку можно, только если в ней:
// - есть хотя бы одно сборочное задание
// - для всех сборочных заданий указана обязательная маркировка
// - маркировка всех сборочных заданий прошла проверку
// Если поставка содержит сборочные задания с обязательным УИН, убедитесь, что вы заранее создали и загрузили спецификацию с договором на доставку. [ГИИС ДМДК](https://minfin.gov.ru/ru/perfomance/jewels/dmdk) требуется около 30 минут для обработки изменений в статусах УИН.
// Обязательно [указывайте параметры отгрузки](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/patchV3FbsSuppliesShippingMethod) для поставок от продавцов РФ на пункты отгрузки в РФ. Если способ доставки, дата или пункт отгрузки не указаны, возвращается ошибка `409`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV3SuppliesSupplyIdDeliver(Знач supplyId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		СтрШаблон("/api/v3/supplies/%1/deliver", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Добавить сборочные задания к поставке
//
// Метод добавляет до 100 [сборочных заданий](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders) к поставке и переводит их в [статус](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/postV3OrdersStatus) `confirm` — на сборке.
// Может перемещать сборочные задания:
// - между активными поставками
// - из закрытой поставки в активную, если сборочные задания требуют [повторной отгрузки](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3SuppliesOrdersReshipment)
//
// В пустую поставку можно добавить сборочные задания любого габаритного типа. Поставка приобретает габаритный тип первого добавленного сборочного задания [из поля](./orders-fbs#tag/fbsSupplies/operation/getV3SuppliesSupplyId) `cargoType`.
//
// После этого в поставку можно добавить сборочные задания только того же габаритного типа, что и у поставки.
//
// В поставку нельзя добавить сборочные задания, поступившие на разные склады.
//
// В пустую поставку можно добавить сборочные задания трансграничных или внутренних поставок.
// После этого поставка приобретает тип первого добавленного сборочного задания из поля `crossBorderType`.
// Далее в неё можно добавить только сборочные задания такого же типа.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//   Тело - OrdersFbsPatchV3SuppliesSupplyIdOrdersRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV3SuppliesSupplyIdOrders(Знач supplyId, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		СтрШаблон("/api/marketplace/v3/supplies/%1/orders", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить данные СПОТ для списка поставок
//
// Метод возвращает данные СПОТ для списка поставок.
//
// Вы можете получить данные СПОТ, только если выполняются все условия:
// - поставка находится на этапе доставки
// - продавец зарегистрирован в любой стране ЕАЭС кроме РФ
// - склад назначения находится в РФ
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   Тело - OrdersFbsPostV3FbsSuppliesSpotListRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3FbsSuppliesSpotList(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/marketplace/v3/fbs/supplies/spot/list",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Создать новую поставку
//
// Метод создаёт новую [поставку](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/getV3SuppliesSupplyId).
// Ограничения:
// - Только для [сборочных заданий](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders) по модели FBS.
// - При добавлении в поставку все передаваемые сборочные задания в [статусе](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/postV3OrdersStatus) `new` будут автоматически переведены в статус `confirm` — на сборке.
// - Если вы переведёте сборочное задание в статус `cancel` — отмена продавцом, прикрепленное сборочное задание автоматически удалится из поставки.
// - Поставку можно собрать только из сборочных заданий (заказов) одного габаритного типа `cargoType`. Новая поставка не обладает габаритным признаком, она приобретает габаритный признак первого заказа, добавленного в поставку.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   Тело - OrdersFbsPostV3SuppliesRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3Supplies(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/supplies",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Добавить грузоместа к поставке
//
// Метод добавляет требуемое количество [грузомест](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/getV3SuppliesSupplyIdTrbx) в [поставку](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/getV3SuppliesSupplyId).
//
// Грузоместа необходимо добавлять только в поставки, отгружаемые на ПВЗ.
//
// Грузоместа можно добавить только в открытую поставку. В одном грузоместе может быть несколько заказов. Например, если в поставке 10 заказов, распределите их по коробам: система позволит создать не больше 5 грузомест. Для 20 заказов — не больше 10 грузомест, для 100 — не больше 50.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//   Тело - OrdersFbsPostV3SuppliesSupplyIdTrbxRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3SuppliesSupplyIdTrbx(Знач supplyId, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		СтрШаблон("/api/v3/supplies/%1/trbx", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить стикеры грузомест поставки
//
// Метод возвращает QR-стикеры в форматах:
// - SVG
// - ZPLV (вертикальный)
// - ZPLH (горизонтальный)
// - PNG
//
// Размер стикеров — 580x400 px.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   supplyId - Строка - ID поставки
//   type - Строка - Тип стикера
//   Тело - OrdersFbsPostV3SuppliesSupplyIdTrbxStickersRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3SuppliesSupplyIdTrbxStickers(Знач supplyId, Знач type, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("type", type);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		СтрШаблон("/api/v3/supplies/%1/trbx/stickers", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Добавить данные СПОТ в поставку
//
// Метод добавляет данные СПОТ в поставку.
//
// СПОТ можно добавить только в [поставку](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/getV3SuppliesSupplyId) с признаком `\"spotAvailable\":true`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   supplyId - Строка - ID поставки
//   Тело - OrdersFbsPutV3FbsSuppliesSupplyIdSpotRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PutV3FbsSuppliesSupplyIdSpot(Знач supplyId, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PUT",
		СтрШаблон("/api/marketplace/v3/fbs/supplies/%1/spot", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

