// СборочныеЗаданияFBSApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый СборочныеЗаданияFBSApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Получить список архивных сборочных заданий
//
// Метод возвращает сборочные задания, созданные более 3 месяцев назад.
// Часть сборочных заданий попадает в архив позже, чем через 3 месяца после создания, так как поставка переходит в архив только после того, как все заказы в ней будут завершены.
// Например, так происходит, если продавец не доставил один из заказов в поставке и заказ был отменён автоматически через несколько дней.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   year - Число - Год создания заказа
//   month - Число - Месяц создания заказа
//   next - Число - Параметр пагинации. Устанавливает значение, с которого надо получить следующий пакет данных. Для получения полного списка данных должен быть равен `0` в первом…
//   limit - Число - Количество сборочных заданий в ответе
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3FbsOrdersArchive(Знач year, Знач month, Знач next, Знач limit) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("year", year);
	ПараметрыЗапроса.Вставить("month", month);
	ПараметрыЗапроса.Вставить("next", next);
	ПараметрыЗапроса.Вставить("limit", limit);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/marketplace/v3/fbs/orders/archive",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить информацию о сборочных заданиях
//
// Метод возвращает информацию о сборочных заданиях, созданных не более 3 месяцев назад, без их актуального [статуса](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/postV3OrdersStatus).
// Чтобы получить данные за период, укажите в запросе даты начала и окончания периода. Максимум 30 календарных дней одним запросом.
// В ответе метода будут сборочные задания, созданные в указанный период.
//
// Чтобы получить сборочные задания, созданные более 3 месяцев назад, используйте метод получения [списка архивных заказов](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3FbsOrdersArchive).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   limit - Число - Параметр пагинации. Устанавливает предельное количество возвращаемых данных.
//   next - Число - Параметр пагинации. Устанавливает значение, с которого надо получить следующий пакет данных. Для получения полного списка данных должен быть равен `0` в первом…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Число - Дата начала периода в формате Unix timestamp. По умолчанию — дата за 30 дней до запроса. Часовой пояс — UTC
//    * dateTo - Число - Дата конца периода в формате Unix timestamp. Часовой пояс — UTC
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3Orders(Знач limit, Знач next, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("limit", limit);
	ПараметрыЗапроса.Вставить("next", next);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v3/orders",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить список новых сборочных заданий
//
// Метод возвращает список всех новых [сборочных заданий](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders), которые есть у продавца на момент запроса.
//
// Наличие в сборочных заданиях идентификаторов маркировки, указанных в полях `requiredMeta` и `optionalMeta`, влияет только на возможность перевести поставку в доставку. Если ваш товар подлежит обязательной [маркировке](https://seller.wildberries.ru/instructions/ru/ru/material/items-labeling-in-fbs) средствами
// идентификации, необходимо указывать идентификаторы маркировки независимо от того, в каком поле они были получены (п. 4.6 [Оферты](https://seller.wildberries.ru/confirm-offer-condition/product/view)).
//
// Рекомендуем добавлять в сборочные задания все идентификаторы маркировки, полученные в полях `requiredMeta` и `optionalMeta`
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3OrdersNew() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v3/orders/new",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить все сборочные задания для повторной отгрузки
//
// Метод возвращает все [сборочные задания](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders), требующие повторной отгрузки.
//
// Повторная отгрузка требуется, если поставка была отсканирована в пункте приёмки, но при этом в ней всё ещё есть неотсканированные товары. Спустя определённое время необходимо доставить эти товары заново. Данные сборочные задания можно перевести в [другую активную поставку](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/patchV3SuppliesSupplyIdOrders).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3SuppliesOrdersReshipment() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v3/supplies/orders/reshipment",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Отменить сборочное задание
//
// Метод отменяет [сборочное задание](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders) и переводит в [статус](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/postV3OrdersStatus) `cancel` — отменено продавцом.
//
// Сборочное задание можно отменить до его передачи Wildberries.
// Чтобы проверить, можно ли отменить сборочное задание, используйте метод [POST /api/v3/orders/status](https://dev.wildberries.ru/docs/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/postV3OrdersStatus), поле `isCancellable`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 100 запросов | 600 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   orderId - Число - ID сборочного задания
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV3OrdersOrderIdCancel(Знач orderId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		СтрШаблон("/api/v3/orders/%1/cancel", Транспорт.ЭкранироватьСегмент(orderId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Заказы с информацией по клиенту
//
// Метод позволяет получать информацию о покупателе по ID сборочного задания.
// Только для трансграничных поставок из \\*\\*Турции\\*\\*.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   Тело - OrdersFbsOrdersRequestAPI
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3OrdersClient(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/orders/client",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить статусы сборочных заданий
//
// Метод возвращает статусы [сборочных заданий](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders) по их ID.
//
// `supplierStatus` — статус сборочного задания. Триггер его изменения — действие самого продавца.
// Возможные значения `supplierStatus`:
// | Статус | Описание | Как перевести сборочное задание в данный статус |
// |-------|----------------------|--------------------------------------|
// | `new` | \\*\\*Новое сборочное задание\\*\\* | |
// | `confirm` | \\*\\*На сборке\\*\\* |[Добавить сборочное задание к поставке](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/patchV3SuppliesSupplyIdOrders)
// | `complete` | \\*\\*В доставке\\*\\* | [Передать поставку в доставку](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsSupplies/operation/patchV3SuppliesSupplyIdDeliver) |
// | `cancel` | \\*\\*Отменено продавцом\\*\\* | [Отменить сборочное задание](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/patchV3OrdersOrderIdCancel)|
// | `cancel\\_carrier` | \\*\\*Отменено перевозчиком\\*\\*
// Только для трансграничных поставок | Переводится перевозчиком |
//
// `wbStatus` — статус системы Wildberries.
// Возможные значения `wbStatus`:
// - `waiting` — сборочное задание в работе
// - `sorted` — сборочное задание отсортировано
// - `sold` — заказ получен покупателем
// - `canceled` — отмена сборочного задания
// - `canceled\\_by\\_client` — покупатель отменил заказ при получении
// - `declined\\_by\\_client` — покупатель отменил заказ. Отмена доступна покупателю в первый час с момента заказа, если заказ не переведён на сборку
// - `defect` — отмена заказа по причине брака
// - `ready\\_for\\_pickup` — заказ прибыл на пункт выдачи заказов (ПВЗ)
// - `accepted\\_by\\_carrier` — продавец передал заказ в службу доставки в своей стране
// - `sent\\_to\\_carrier` — заказ отправлен на склад службы доставки в стране продавца
// - `canceled\\_by\\_carrier` — заказ отменён перевозчиком. Только для трансграничных поставок
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   Тело - OrdersFbsPostV3OrdersStatusRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3OrdersStatus(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/orders/status",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// История статусов для сборочных заданий трансграничных поставок
//
// Метод возвращает историю [статусов](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/postV3OrdersStatus) для [сборочных заданий](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders) трансграничных поставок.
// В песочнице этот метод всегда возвращает ответ `200`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   Тело - OrdersFbsPostV3OrdersStatusHistoryRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3OrdersStatusHistory(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/orders/status/history",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить стикеры сборочных заданий
//
// Метод возвращает список стикеров для [сборочных заданий](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders) в [статусах](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/postV3OrdersStatus) `confirm` — на сборке и `complete` — в доставке.
//
// Если за сборочным заданием не закреплён обязательный [номер декларации на товары (ДТ)](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsLabelIdentifiers/operation/putV3OrdersOrderIdMetaCustomsDeclaration), получить стикеры для этого сборочного задания невозможно.
//
// За один запрос можно получить максимум 100 стикеров.
// Можно получить стикер в форматах:
// - SVG
// - ZPLV (вертикальный)
// - ZPLH (горизонтальный)
// - PNG
// Доступны размеры:
// - 580x400 px при `width=58&height=40` в запросе
// - 400x300 px при `width=40&height=30` в запросе
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов.
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Маркетплейса**.
//
// Параметры:
//   type - Строка - Тип стикера
//   width - Число - Ширина стикера
//   height - Число - Высота стикера
//   Тело - OrdersFbsPostV3OrdersStickersRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3OrdersStickers(Знач type, Знач width, Знач height, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("type", type);
	ПараметрыЗапроса.Вставить("width", width);
	ПараметрыЗапроса.Вставить("height", height);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/orders/stickers",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить стикеры сборочных заданий трансграничных поставок
//
// Метод возвращает список стикеров [сборочных заданий](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/getV3Orders) трансграничных поставок в формате PDF.
//
// Для каждого сборочного задания в ответе указывается статус генерации стикера:
// - `awaitingTrackNumber` — стикер не готов. Ожидается трек-номер от перевозчика.
// - `ready` — стикер готов
//
// Стикер может генерироваться с задержкой. Повторяйте запрос, пока не получите статус `ready`.
//
// Ограничения:
// - За один запрос можно получить максимум 100 стикеров.
// - Можно получить стикеры только для сборочных заданий, находящихся на сборке или в доставке — [статусы](https://dev.wildberries.ru/openapi/orders-fbs#tag/fbsAssemblyOrders/operation/postV3OrdersStatus) `confirm`, `complete`.
// В песочнице этот метод всегда возвращает ответ `200`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов **сборочных заданий, поставок, пропусков и настроек автовозврата FBS**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   Тело - OrdersFbsPostV3OrdersStickersCrossBorderRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3OrdersStickersCrossBorder(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/orders/stickers/cross-border",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

