// ДокументыApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ДокументыApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Категории документов
//
// Метод возвращает категории документов для получения [списка документов продавца](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/documents/operation/getV1DocumentsList).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Сервисный | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Базовый с секретом | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Базовый | 24 ч | 1 запрос | 24 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * locale - Строка - Язык поля `title`: - `ru` — русский - `en` — английский - `zh` — китайский
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1DocumentsCategories(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/documents/categories",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://documents-api.wildberries.ru");

КонецФункции

// Получить документ
//
// Метод загружает один документ из [списка документов продавца](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/documents/operation/getV1DocumentsList).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Сервисный | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Базовый с секретом | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Базовый | 24 ч | 1 запрос | 24 ч | 1 запрос |
//
// Параметры:
//   serviceName - Строка - Уникальный ID документа
//   extension - Строка - Формат документа
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1DocumentsDownload(Знач serviceName, Знач extension) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("serviceName", serviceName);
	ПараметрыЗапроса.Вставить("extension", extension);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/documents/download",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://documents-api.wildberries.ru");

КонецФункции

// Список документов
//
// Метод возвращает список документов продавца. Вы можете получить [один](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/documents/operation/getV1DocumentsDownload) или [несколько](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/documents/operation/postV1DocumentsDownloadAll) документов из полученного списка.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Сервисный | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Базовый с секретом | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Базовый | 24 ч | 1 запрос | 24 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * locale - Строка - Язык поля `category`: - `ru` — русский - `en` — английский - `zh` — китайский
//    * beginTime - Дата - Начало периода. Только вместе с `endTime`
//    * endTime - Дата - Конец периода. Только вместе с `beginTime`
//    * sort - Строка - Сортировка: - `date` — по дате создания документа - `category` — по категории (только при `locale=ru`) Только вместе с `order`
//    * order - Строка - Сортировка: - `desc` — по убыванию - `asc` — по возрастанию Только вместе с `sort`
//    * category - Строка - ID [категории документов](./documents-and-accounting#tag/documents/operation/getV1DocumentsCategories) из поля `name`
//    * serviceName - Строка - Уникальный ID документа
//    * limit - Число - Максимальное количество строк ответа
//    * offset - Число - После какой строки выдавать данные
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1DocumentsList(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/documents/list",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://documents-api.wildberries.ru");

КонецФункции

// Получить документы
//
// Метод загружает несколько документов из [списка документов продавца](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/documents/operation/getV1DocumentsList).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 мин | 1 запрос | 5 мин | 5 запросов |
// | Сервисный | 5 мин | 1 запрос | 5 мин | 5 запросов |
// | Базовый с секретом | 5 мин | 1 запрос | 5 мин | 5 запросов |
// | Базовый | 24 ч | 1 запрос | 24 ч | 1 запрос |
//
// Параметры:
//   Тело - FinancesRequestDownload
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1DocumentsDownloadAll(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/documents/download/all",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://documents-api.wildberries.ru");

КонецФункции

