// ВоронкаПродажApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ВоронкаПродажApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Статистика групп карточек товаров по дням
//
// Метод возвращает статистику карточек товаров по дням или неделям.
// Карточки товаров сгруппированы по предметам, брендам и ярлыкам.
// Можно получить данные максимум за последнюю неделю.
//
// Данные отчёта обновляются 1 раз в час.
//
// В течение часа после события появляется большая часть данных:
// - о заказах
// - о переходах в карточку товара
// - о добавлениях товаров в корзину
// Малая часть этих данных может появляться в течение нескольких дней.
//
// Выкупы, отмены и возвраты отображаются в отчёте за тот день, когда товар был заказан. Например, если заказ был сделан 1 января, а покупатель вернул товар 10 января, данные об этом возврате появятся в отчёте за 1 января.
// Окончательные итоги продаж вы можете отслеживать с помощью [детализаций к отчётам реализации](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/financialReports).
//
// Параметры `brandNames`, `subjectIds`, `tagIds` могут быть пустыми `[]`, тогда группировка происходит по всем карточкам продавца.
//
// Произведение количества предметов, брендов, ярлыков в запросе может быть не больше 16. Например, 4 бренда и 4 предмета или 2 предмета, 2 ярлыка и 4 бренда.
//
// Чтобы получать отчёты за период до года, используйте методы [Аналитика продавца CSV](https://dev.wildberries.ru/openapi/analytics#tag/sellerAnalyticsCsv) — тип `GROUPED_HISTORY_REPORT`. Отчёты этого типа доступны только с подпиской [Джем](https://seller.wildberries.ru/monetization/jam)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsGroupedHistoryRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3SalesFunnelGroupedHistory(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/analytics/v3/sales-funnel/grouped/history",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Статистика карточек товаров за период
//
// Метод формирует отчёт о товарах, сравнивая ключевые показатели за текущий период с аналогичным прошлым.
//
// Данные отчёта обновляются 1 раз в час.
//
// В течение часа после события появляется большая часть данных:
// - о заказах
// - о переходах в карточку товара
// - о добавлениях товаров в корзину
// Малая часть этих данных может появляться в течение нескольких дней.
//
// Выкупы, отмены и возвраты отображаются в отчёте за тот день, когда товар был заказан. Например, если заказ был сделан 1 января, а покупатель вернул товар 10 января, данные об этом возврате появятся в отчёте за 1 января.
// Окончательные итоги продаж вы можете отслеживать с помощью [детализаций к отчётам реализации](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/financialReports).
//
// Параметры `brandNames`,`subjectIds`, `tagIds`, `nmIds` могут быть пустыми `[]`, тогда в ответе возвращаются все карточки продавца.
//
// Если вы указали несколько параметров, в ответе будут карточки, в которых есть одновременно все эти параметры. Если карточки не подходят по параметрам запроса, вернётся пустой ответ `[]`.
//
// Можно получить отчёт максимум за последние 365 дней.
//
// В данных предыдущего периода:
// \\* Данные в `pastPeriod` указаны за такой же период, что и в `selectedPeriod`
// \\* Если дата начала `pastPeriod` раньше, чем год назад от текущей даты, она будет приведена к виду: `pastPeriod.start = текущая дата — 365 дней`
// Можно использовать пагинацию.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsItemsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3SalesFunnelProducts(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/analytics/v3/sales-funnel/products",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Статистика карточек товаров по дням
//
// Метод возвращает статистику карточек товаров по дням или неделям.
// Можно получить данные максимум за последнюю неделю.
//
// Данные отчёта обновляются 1 раз в час.
//
// В течение часа после события появляется большая часть данных:
// - о заказах
// - о переходах в карточку товара
// - о добавлениях товаров в корзину
// Малая часть этих данных может появляться в течение нескольких дней.
//
// Выкупы, отмены и возвраты отображаются в отчёте за тот день, когда товар был заказан. Например, если заказ был сделан 1 января, а покупатель вернул товар 10 января, данные об этом возврате появятся в отчёте за 1 января.
// Окончательные итоги продаж вы можете отслеживать с помощью [детализаций к отчётам реализации](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/financialReports).
//
// Чтобы получать отчёты за период до года, используйте методы [Аналитика продавца CSV](https://dev.wildberries.ru/openapi/analytics#tag/sellerAnalyticsCsv) — тип `DETAIL_HISTORY_REPORT`. Отчёты этого типа доступны только с подпиской [Джем](https://seller.wildberries.ru/monetization/jam)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsItemHistoryRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3SalesFunnelProductsHistory(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/analytics/v3/sales-funnel/products/history",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

