// ИсторияОстатковApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ИсторияОстатковApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Остатки на складах продавца
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод возвращает текущие остатки товаров на складах продавца.
//
// Данные обновляются 1 раз в 30 минут.
//
// 1 строка ответа — данные об 1 размере товара на 1 складе продавца.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 3 запроса | 20 сек | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsInventoryRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostAnalyticsV1StocksReportSellerWarehouses(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/analytics/v1/stocks-report/seller-warehouses",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Остатки на складах WB
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену,
// **Базовому** токену **с секретом**
//
// Метод возвращает текущие остатки товаров на складах WB.
//
// Данные обновляются 1 раз в 30 минут.
//
// 1 строка ответа — данные об 1 размере товара на 1 складе WB.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 3 запроса | 20 сек | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsInventoryRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1StocksReportWbWarehouses(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/analytics/v1/stocks-report/wb-warehouses",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Данные по складам
//
// Метод формирует набор данных об остатках по складам.
//
// Данные по складам продавца приходят в агрегированном виде — по всем сразу, без детализации по конкретным складам — эти записи будут с `\"regionName\":\"Свой склад\"` и `\"offices\":[]`.
//
// Данные отчёта обновляются 1 раз в 2 часа.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsTableShippingOfficeRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2StocksReportOffices(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/stocks-report/offices",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Данные по группам
//
// Метод формирует набор данных об остатках по группам товаров.
//
// Группа товаров описывается кортежем `subjectID, brandName, tagID`.
//
// Данные отчёта обновляются 1 раз в 2 часа.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsTableGroupRequestSt
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2StocksReportProductsGroups(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/stocks-report/products/groups",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Данные по товарам
//
// Метод формирует набор данных об остатках по товарам.
//
// Можно получить данные как по отдельным товарам, так и в рамках всего отчёта — если в запросе отсутствуют фильтры: `nmIDs`, `subjectID`, `brandName`, `tagID`.
//
// Данные отчёта обновляются 1 раз в 2 часа.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsTableItemRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2StocksReportProductsProducts(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/stocks-report/products/products",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Данные по размерам
//
// Метод формирует набор данных об остатках по размерам товара.
//
// Возможны случаи:
// 1. Товар имеет размеры и `\"includeOffice\":true`, тогда в ответе будут данные об остатках по каждому из размеров с вложенной детализацией по складам.
// 2. Товар имеет размеры и `\"includeOffice\":false`, тогда в ответе будут данные об остатках по каждому из размеров без вложенной детализации по складам.
// 3. Товар не имеет размера и `\"includeOffice\":true`, тогда в ответе будет детализация по складам. Без данных об остатках по каждому из размеров.
// 4. Товар не имеет размера и `\"includeOffice\":false`, тогда тело ответа будет пустым.
// Товар не имеет размера, если у него единственный размер с `\"techSize\":\"0\"`. В ответах метода получения данных по [товарам](https://dev.wildberries.ru/openapi/analytics#tag/stocksReport/operation/postV2StocksReportProductsProducts) у таких товаров `\"hasSizes\":false`.
// Данные по складам продавца приходят в агрегированном виде — по всем сразу, без детализации по конкретным складам — эти записи будут с `\"regionName\":\"Свой склад\"` и `\"officeName\":\"\"`.
//
// Данные отчёта обновляются 1 раз в 2 часа.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsTableSizeRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2StocksReportProductsSizes(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/stocks-report/products/sizes",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

