// ПоисковыеЗапросыПоВашимТоварамApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ПоисковыеЗапросыПоВашимТоварамApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Заказы и позиции по поисковым запросам товара
//
// Метод формирует данные для таблицы:
// - о заказах по каждому поисковому запросу для конкретного товара
// - о позициях товара в результатах поиска по каждому запросу
// Данные указаны в рамках периода для [запрошенного товара](https://dev.wildberries.ru/openapi/analytics#tag/searchQueriesForYourItems/operation/postV2SearchReportProductSearchTexts) и сгруппированы по дням. Максимальный период — 7 дней.
//
// Данные отчёта обновляются 1 раз в час.
//
// Можно получить отчёт максимум за последние 365 дней с момента выполнения запроса
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsItemOrdersRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2SearchReportProductOrders(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/search-report/product/orders",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Поисковые запросы по товару
//
// Метод формирует топ поисковых запросов по товару.
// Параметры выбора поисковых запросов:
// - `limit` — количество запросов, максимум 30. Для тарифов [Джема](https://seller.wildberries.ru/monetization/tariffs) \\*\\*Продвинутый\\*\\* и \\*\\*Премиальный\\*\\* максимум — 100.
// - `topOrderBy` — способ выбора топа запросов
// Параметры `includeSubstitutedSKUs` и `includeSearchTexts` не могут одновременно иметь значение `false`.
//
// Данные отчёта обновляются 1 раз в час.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsItemSearchTextsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2SearchReportProductSearchTexts(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/search-report/product/search-texts",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Основная страница
//
// Метод формирует набор данных для основной страницы отчёта по поисковым запросам с:
// - общей информацией
// - позициями товаров
// - данными по видимости и переходам в карточку
// - данными для таблицы по группам
// Для получения дополнительных данных в таблице используйте отдельный запрос для:
// - [пагинации по группам](https://dev.wildberries.ru/openapi/analytics#tag/searchQueriesForYourItems/operation/postV2SearchReportTableGroups)
// - [получения по товарам в группе](https://dev.wildberries.ru/openapi/analytics#tag/searchQueriesForYourItems/operation/postV2SearchReportTableDetails)
// Дополнительный параметр выбора списка товаров в таблице:
// - `positionCluster` — средняя позиция в поиске
// Параметры `includeSubstitutedSKUs` и `includeSearchTexts` не могут одновременно иметь значение `false`.
//
// Данные отчёта обновляются 1 раз в час.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsMainRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2SearchReportReport(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/search-report/report",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Пагинация по товарам в группе
//
// Метод формирует дополнительные данные к [основному отчёту](https://dev.wildberries.ru/openapi/analytics#tag/searchQueriesForYourItems/operation/postV2SearchReportReport) с пагинацией по товарам в группе. Пагинация возможна вне зависимости от наличия фильтров.
//
// Фильтры для пагинации по товарам в группе или без фильтров:
// - кортеж `subjectId`,`brandName`,`tagId` — фильтр для группы
// - `nmIds` — фильтр по карточке товара
// Дополнительный параметр выбора списка товаров:
// - `positionCluster` — средняя позиция в поиске
// Параметры `includeSubstitutedSKUs` и `includeSearchTexts` не могут одновременно иметь значение `false`.
//
// Данные отчёта обновляются 1 раз в час.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsTableDetailsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2SearchReportTableDetails(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/search-report/table/details",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Пагинация по группам
//
// Метод формирует дополнительные данные к [основному отчёту](https://dev.wildberries.ru/openapi/analytics#tag/searchQueriesForYourItems/operation/postV2SearchReportReport) с пагинацией по группам. Пагинация возможна только при наличии фильтра по бренду, предмету или ярлыку.
//
// Дополнительный параметр выбора списка товаров в таблице:
// - `positionCluster` — средняя позиция в поиске
// Параметры `includeSubstitutedSKUs` и `includeSearchTexts` не могут одновременно иметь значение `false`.
//
// Данные отчёта обновляются 1 раз в час.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 3 запроса |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - AnalyticsTableGroupRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2SearchReportTableGroups(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/search-report/table/groups",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

