// СборочныеЗаданияDBWApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый СборочныеЗаданияDBWApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Получить информацию о завершенных сборочных заданиях
//
// Метод возвращает информацию о завершенных [сборочных заданиях](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders).
//
// Можно получить данные за заданный период, максимум 30 календарных дней одним запросом.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для следующих методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * методы сборочных заданий
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   limit - Число - Параметр пагинации. Устанавливает предельное количество возвращаемых данных
//   next - Число - Параметр пагинации. Устанавливает значение, с которого надо получить следующий пакет данных. Для получения полного списка данных должен быть равен `0` в первом…
//   dateFrom - Число - Дата начала периода в формате Unix timestamp
//   dateTo - Число - Дата конца периода в формате Unix timestamp
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3DbwOrders(Знач limit, Знач next, Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("limit", limit);
	ПараметрыЗапроса.Вставить("next", next);
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v3/dbw/orders",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить список новых сборочных заданий
//
// Метод возвращает список всех новых [сборочных заданий](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders), которые есть у продавца на момент запроса.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для следующих методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * методы сборочных заданий
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3DbwOrdersNew() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v3/dbw/orders/new",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Отменить сборочное задание
//
// Метод отменяет [сборочное задание](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders) и переводит в [статус](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders/operation/postV3DbwOrdersStatus) `cancel` — отменено продавцом.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * управление сборочными заданиями
//
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 300 запросов | 200 мс | 20 запросов |
// | Сервисный | 1 мин | 300 запросов | 200 мс | 20 запросов |
// | Базовый с секретом | 1 мин | 300 запросов | 200 мс | 20 запросов |
// | Базовый | 1 ч | 10 запросов | 6 мин | 1 запрос |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   orderId - Число - ID сборочного задания
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV3DbwOrdersOrderIdCancel(Знач orderId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		СтрШаблон("/api/v3/dbw/orders/%1/cancel", Транспорт.ЭкранироватьСегмент(orderId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Перевести на сборку
//
// Метод переводит [сборочное задание](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders) в [статус](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders/operation/postV3DbwOrdersStatus) `confirm` — на сборке.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для следующих методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * методы сборочных заданий
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   orderId - Число - ID сборочного задания
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV3DbwOrdersOrderIdConfirm(Знач orderId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		СтрШаблон("/api/v3/dbw/orders/%1/confirm", Транспорт.ЭкранироватьСегмент(orderId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Информация о покупателе
//
// Метод возвращает информацию о покупателях по ID сборочных заданий.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для следующих методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * методы сборочных заданий
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   Тело - OrdersDbwOrdersRequestAPI
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3DbwOrdersClient(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/marketplace/v3/dbw/orders/client",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Информация о курьере
//
// Метод возвращает контактные данные и номер автомобиля курьера по ID сборочного задания.
// Для сборочных заданий в статусах `confirm`, `complete`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для следующих методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * методы сборочных заданий
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   Тело - OrdersDbwOrdersRequestAPI
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3DbwOrdersCourier(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/dbw/orders/courier",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить дату и время доставки
//
// Метод возвращает информацию о выбранных покупателем дате и времени доставки сборочных заданий.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для следующих методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * методы сборочных заданий
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   Тело - OrdersDbwDeliveryDatesRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3DbwOrdersDeliveryDate(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/dbw/orders/delivery-date",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить статусы сборочных заданий
//
// Метод возвращает статусы сборочных заданий по их ID.
//
// `supplierStatus` — статус сборочного задания.
// Триггер его изменения — действие самого продавца.
// Возможные значения `supplierStatus`:
// | Статус | Описание | Как перевести сборочное задание в данный статус |
// | ------- | --------- | --------------------------------------|
// | `new` | \\*\\*Новое сборочное задание\\*\\* | |
// | `confirm` | \\*\\*На сборке\\*\\* | [Перевести сборочное задание на сборку](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders/operation/patchV3DbwOrdersOrderIdConfirm)
// | `complete` | \\*\\*В доставке\\*\\* | [Перевести сборочное задание в доставку](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders/operation/postV3DbwOrdersStatusDeliver) |
// | `receive` | \\*\\*Получено покупателем\\*\\*| Переводится курьером
// | `reject` | \\*\\*Отказ покупателя при получении\\*\\*| Переводится курьером
// | `cancel` | \\*\\*Отменено продавцом\\*\\* | [Отменить сборочное задание](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders/operation/patchV3DbwOrdersOrderIdCancel)
// | `cancel\\_missed\\_call` | \\*\\*Отмена по причине недозвона\\*\\*
// | Статус меняется автоматически |
//
// `wbStatus` — статус системы Wildberries.
// Возможные значения `wbStatus`:
// - `waiting` — сборочное задание в работе
// - `sold` — заказ получен покупателем
// - `canceled` — отмена сборочного задания
// - `canceled\\_by\\_client` — покупатель отменил заказ при получении
// - `declined\\_by\\_client` — покупатель отменил заказ в первый чаc
//
// Отмена доступна покупателю в первый час с момента заказа, если заказ не переведен на сборку
// - `defect` — отмена заказа по причине брака
// - `canceled\\_by\\_missed\\_call` — отмена заказа по причине недозвона
// - `postponed\\_delivery` — курьерская доставка отложена
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для следующих методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * методы сборочных заданий
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   Тело - OrdersDbwPostV3DbwOrdersStatusRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3DbwOrdersStatus(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/dbw/orders/status",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Перевести сборочные задания в доставку
//
// Метод переводит [сборочные задания](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders/operation/getV3DbwOrders) из [статуса](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders/operation/postV3DbwOrdersStatus) `confirm` в статус `complete` — в доставке.
//
// Проверяйте ответ метода. Сборочные задания, переведённые в доставку, вернутся с признаком `\"isError\":false`. Для остальных сборочных заданий смотрите причину ошибки в массиве `errors`
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для следующих методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * методы сборочных заданий
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   Тело - OrdersDbwApiOrdersRequestV2
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3DbwOrdersStatusDeliver(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/marketplace/v3/dbw/orders/status/deliver",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

// Получить стикеры сборочных заданий
//
// Метод возвращает список стикеров для [сборочных заданий](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders/operation/getV3DbwOrdersNew) в [статусах](https://dev.wildberries.ru/openapi/orders-dbw#tag/dbwAssemblyOrders/operation/postV3DbwOrdersStatus):
// - `confirm` — на сборке
// - `complete` — в доставке
// За один запрос можно получить максимум 100 стикеров.
// Доступные форматы стикеров:
// - SVG
// - ZPLV (вертикальный)
// - ZPLH (горизонтальный)
// - PNG
// Доступны размеры:
// - 580x400 px при `width=58&height=40` в запросе
// - 400x300 px при `width=40&height=30` в запросе
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для следующих методов DBW:
//
// * получение и обновление списка контактов
// * получение и удаление идентификаторов маркировки
// * методы сборочных заданий
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 300 запросов | 200 мс | 20 запросов |
// Один запрос с кодами ответов `4XX` учитывается как 10 запросов
//
// Параметры:
//   type - Строка - Тип стикера
//   width - Число - Ширина стикера
//   height - Число - Высота стикера
//   Тело - OrdersDbwPostV3DbwOrdersStickersRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3DbwOrdersStickers(Знач type, Знач width, Знач height, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("type", type);
	ПараметрыЗапроса.Вставить("width", width);
	ПараметрыЗапроса.Вставить("height", height);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v3/dbw/orders/stickers",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://marketplace-api.wildberries.ru");

КонецФункции

