// КарточкиТоваровApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый КарточкиТоваровApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Перенос карточек товаров в корзину
//
// Метод переносит [карточки товаров в корзину](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2GetCardsTrash). При этом карточки товаров не удаляются, их можно [восстановить](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2CardsRecover).
//
// После переноса в корзину карточке товара присваивается новый `imtID` — ID для [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-kartochek-tovarov) карточек товаров
//
// Карточки товаров удаляются автоматически, если лежат в корзине больше 30 дней, и на них нет остатков. Очистка корзины происходит каждую ночь по московскому времени.
// Карточки товаров можно удалить в любое время в [личном кабинете](https://seller.wildberries.ru/new-goods/basket-cards).
//
// Карточка будет продаваться, пока по ней есть остатки на складе, даже если её переместили в корзину. Чтобы полностью снять карточку с продажи, обнулите остатки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Сервисный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - ItemsPostV2CardsDeleteTrashRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2CardsDeleteTrash(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v2/cards/delete/trash",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

// Список несозданных карточек товаров с ошибками
//
// Метод возвращает список карточек товаров ([черновиков](https://seller.wildberries.ru/new-goods/error-cards)), при создании или редактировании которых произошли ошибки, с описанием этих ошибок.
//
// Данные в ответе возвращаются пакетами `batch`. Один пакет содержит:
// - все ошибки по одному массиву `variants` одного запроса при [создании](https://dev.wildberries.ru/openapi/item-management#tag/listingItems/operation/postV2CardsUpload) карточек товаров
// - все ошибки одного запроса при [создании с присоединением](https://dev.wildberries.ru/openapi/item-management#tag/listingItems/operation/postV2CardsUploadAdd) или [редактировании](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2CardsUpdate) карточек товаров
//
// Чтобы получить более 100 пакетов, используйте пагинацию:
// 1. Сделайте первый запрос:
//
// ```
// {
// \"cursor\": {
// \"limit\": 100
// },
// \"order\": {
// \"ascending\": true
// }
// }
// ```
//
// 2. Скопируйте `\"updatedAt\":\"\\*\\*\\*\",\"batchUUID\":\"\\*\\*\\*\" `из `cursor` ответа и вставьте в `cursor` запроса.
// 3. Повторите запрос.
// 4. Повторяйте пункты 2 и 3, пока не получите в ответе `\"next\":false`. Это будет означать, что вы получили все пакеты.
//
// Чтобы удалить карточку товара из списка, сделайте ещё один запрос на создание, создание с присоединением или редактирование карточки товара с исправленными ошибками
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для методов:
//
// * [получения лимитов карточек товаров](https://dev.wildberries.ru/openapi/item-management#tag/listingItems/operation/getV2CardsLimits)
// * [получения несозданных карточек товаров с ошибками](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2CardsErrorList)
//
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 10 запросов | 6 сек | 5 запросов |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsRequestPublicViewerPublicErrorsTableListV2
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * locale - Строка - Язык названий предметов: - `ru` — русский - `en` — английский - `zh` — китайский Не используется в песочнице
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2CardsErrorList(Знач Тело, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v2/cards/error/list",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

// Объединение и разъединение карточек товаров
//
// Метод [объединяет и разъединяет](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-kartochek-tovarov) карточки товаров. Карточки товаров являются объединёнными, если у них одинаковый `imtID`.
//
// Для объединения карточек товаров сделайте запрос \\*\\*с указанием\\*\\* `imtID`. Можно объединять не более 30 карточек товаров.
// Для разъединения карточек товаров сделайте запрос \\*\\*без указания\\*\\* `imtID`. Для разъединенных карточек будут сгенерированы новые `imtID`.
//
// Если вы разъедините одновременно несколько карточек товаров, эти карточки объединятся в одну и получат новый `imtID`.
// Чтобы присвоить каждой карточке товара уникальный `imtID`, необходимо передавать по одной карточке товара за запрос.
//
// Максимальный размер запроса 10 Мб.
//
// Объединить можно карточки товаров только в рамках одного предмета
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Контент**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 100 запросов | 600 мс | 5 запросов |
// Исключение — методы:
//
// * [создания карточек товаров](https://dev.wildberries.ru/openapi/item-management#tag/listingItems/operation/postV2CardsUpload)
// * [создания карточек товаров с присоединением](https://dev.wildberries.ru/openapi/item-management#tag/listingItems/operation/postV2CardsUploadAdd)
// * [редактирования карточек товаров](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2CardsUpdate)
// * [восстановления карточек товаров из корзины](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2CardsRecover)
// * [получения списка рекомендаций в карточках товаров](https://dev.wildberries.ru/openapi/item-management#tag/recommendations/operation/postV1RecommendationsList)
// * [установки рекомендаций для товаров](https://dev.wildberries.ru/openapi/item-management#tag/recommendations/operation/postV1RecommendationsSet)
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsPostV2CardsMoveNmRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2CardsMoveNm(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v2/cards/moveNm",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

// Восстановление карточек товаров из корзины
//
// Метод восстанавливает [карточки товаров из корзины](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2GetCardsTrash).
//
// Карточка товара сохраняет тот же `imtID` — ID для [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-kartochek-tovarov) карточек товаров — что был присвоен ей при [перемещении в корзину](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2CardsDeleteTrash)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 5 запросов |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - ItemsPostV2CardsDeleteTrashRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2CardsRecover(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v2/cards/recover",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

// Редактирование карточек товаров
//
// Метод обновляет данные карточек товаров. Также используйте его, чтобы добавлять новые размеры.
//
// Карточка товара перезаписывается при обновлении. Поэтому в запросе нужно передать в том числе те параметры карточки, которые вы не собираетесь обновлять. Их значения можно получить в [списке карточек товаров](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2GetCardsList) и [списке карточек товаров в корзине](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2GetCardsTrash).
//
// С помощью этого метода нельзя обновлять или удалять:
// - баркоды размеров товара. Можно только добавить дополнительные баркоды
// - параметры `photos`, `video` и `tags`
// - цены товаров. Цену можно задать, только если вы добавляете новые размеры
// При добавлении нового размера укажите его цену через параметр `price`. Если в запросе не указан `price`, цена размера будет `0` — в этом случае изменить её можно будет с помощью методов:
// - [Установить цены и скидки](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTask), если у [товара](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2ListGoodsFilter) `\"editablePriceSize\":false`
// - [Установить цены для размеров](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskSize), если у [товара](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2ListGoodsFilter) `\"editablePriceSize\":true`
// Габариты товаров можно указать только в `сантиметрах`, вес товара с упаковкой — в `килограммах`.
//
// Одним запросом можно отредактировать максимум 3000 карточек товаров (`nmID`). Максимальный размер запроса 10 Мб.
// Если ответ `Успешно` (`200`), но какие-то карточки не обновились, проверьте [список несозданных карточек товаров](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2CardsErrorList).
// Синхронизация данных с сервисами может занимать до 30 минут. В течение этого времени невозможно добавить остатки на склады и настроить цены.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 10 запросов | 6 сек | 5 запросов |
//
// Параметры:
//   Тело - Массив
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2CardsUpdate(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v2/cards/update",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

// Список карточек товаров
//
// Метод возвращает список созданных карточек товаров.
//
// В ответе метода не будет карточек, находящихся в корзине. Получить такие карточки можно через [отдельный метод](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2GetCardsTrash)
//
// Чтобы получить \\*\\*больше 100\\*\\* карточек товаров, используйте пагинацию:
// 1. Сделайте первый запрос:
//
// ```
// {
// \"settings\": {
// \"sort\": {
// \"ascending\": true
// },
// \"cursor\": {
// \"limit\": 100
// },
// \"filter\": {
// \"withPhoto\": -1
// }
// }
// }
// ```
//
// Чтобы после выгрузки получать только новые или обновлённые карточки товаров, используйте сортировку по возрастанию: `\"sort\":{\"ascending\":true}`.
// 2. Скопируйте `\"updatedAt\":\"\\*\\*\\*\",\"nmID\":\"\\*\\*\\*\"` из `cursor` ответа и вставьте в `cursor` запроса.
// 3. Повторите запрос.
// 4. Повторяйте пункты 2 и 3, пока значение `total` в ответе не станет меньше, чем значение `limit` в запросе. Это будет означать, что вы получили все карточки.
// Чтобы получать только карточки товаров, которые были созданы или обновлены после предыдущей выгрузки данных:
// 1. Сохраните поля `\"cursor\":{\"updatedAt\":\"\\*\\*\\*\",\"nmID\":\"\\*\\*\\*\"}` из последнего ответа предыдущей выгрузки. При выгрузке используйте сортировку по возрастанию: `\"sort\":{\"ascending\":true}`.
// 2. Укажите в первом запросе сохранённые поля `\"cursor\":{\"updatedAt\":\"\\*\\*\\*\",\"nmID\":\"\\*\\*\\*\"}`. Продолжайте использовать сортировку по возрастанию.
// 3. Сохраните поля `\"cursor\":{\"updatedAt\":\"\\*\\*\\*\",\"nmID\":\"\\*\\*\\*\"}` из последнего ответа текущей выгрузки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 100 запросов | 600 мс | 5 запросов |
//
// Параметры:
//   Тело - ItemsPostV2GetCardsListRequest
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * locale - Строка - Язык полей ответа `name`, `value` и `object`: - `ru` — русский - `en` — английский - `zh` — китайский Не используется в песочнице. Данные песочницы возвращаются…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2GetCardsList(Знач Тело, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v2/get/cards/list",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

// Список карточек товаров в корзине
//
// Метод возвращает список карточек товаров в корзине.
//
// Чтобы получить \\*\\*больше 100\\*\\* карточек товаров, используйте пагинацию.
// 1. Сделайте первый запрос:
//
// ```
// {
// \"settings\": {
// \"sort\": {
// \"ascending\": true
// },
// \"cursor\": {
// \"limit\": 100
// }
// }
// }
// ```
//
// Чтобы получать только карточки товаров, которые были перенесены в корзину после выгрузки, используйте сортировку по возрастанию: `\"sort\":{\"ascending\":true}`.
// 2. Скопируйте `\"trashedAt\":\"\\*\\*\\*\",\"nmID\":\\*\\*\\*` из `cursor` ответа и вставьте в `cursor` запроса.
// 3. Повторите запрос.
// 4. Повторяйте пункты 2 и 3, пока значение `total` в ответе не станет меньше, чем значение `limit` в запросе. Это будет означать, что вы получили все карточки.
// Чтобы получать только карточки товаров, которые были перенесены в корзину после предыдущей выгрузки данных:
// 1. Сохраните поля `\"cursor\":{\"trashedAt\":\"\\*\\*\\*\",\"nmID\":\\*\\*\\*}` из последнего ответа предыдущей выгрузки. При выгрузке используйте сортировку по возрастанию: `\"sort\":{\"ascending\":true}`.
// 2. Укажите в первом запросе сохранённые поля `\"cursor\":{\"trashedAt\":\"\\*\\*\\*\",\"nmID\":\"\\*\\*\\*\"}`. Продолжайте использовать сортировку по возрастанию.
// 3. Сохраните поля `\"cursor\":{\"trashedAt\":\"\\*\\*\\*\",\"nmID\":\\*\\*\\*}` из последнего ответа текущей выгрузки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Контент**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 100 запросов | 600 мс | 5 запросов |
// Исключение — методы:
//
// * [создания карточек товаров](https://dev.wildberries.ru/openapi/item-management#tag/listingItems/operation/postV2CardsUpload)
// * [создания карточек товаров с присоединением](https://dev.wildberries.ru/openapi/item-management#tag/listingItems/operation/postV2CardsUploadAdd)
// * [редактирования карточек товаров](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2CardsUpdate)
// * [восстановления карточек товаров из корзины](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2CardsRecover)
// * [получения списка рекомендаций в карточках товаров](https://dev.wildberries.ru/openapi/item-management#tag/recommendations/operation/postV1RecommendationsList)
// * [установки рекомендаций для товаров](https://dev.wildberries.ru/openapi/item-management#tag/recommendations/operation/postV1RecommendationsSet)
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsPostV2GetCardsTrashRequest
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * locale - Строка - Язык полей ответа `name`, `value` и `object`: - `ru` — русский - `en` — английский - `zh` — китайский Не используется в песочнице. Данные песочницы возвращаются…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2GetCardsTrash(Знач Тело, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v2/get/cards/trash",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

