// МедиафайлыApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый МедиафайлыApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Загрузить медиафайл
//
// Метод загружает и добавляет один медиафайл к карточке товара.
// Требования к изображениям:
// \\* максимум изображений для одной карточки товара — 30
// \\* минимальное разрешение — 700x900 px
// \\* максимальный размер — 32 Мб
// \\* минимальное качество — 65%
// \\* форматы — JPG, PNG, BMP, GIF (статичные), WebP
// Требования к видео:
// \\* максимум одно видео для одной карточки товара
// \\* максимальный размер — 50 Мб
// \\* форматы — MOV, MP4
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов **Медиафайлов**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Сервисный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   XNmId - Строка - Артикул WB
//   XPhotoNumber - Число - Номер медиафайла на загрузку, начинается с `1`. При загрузке видео всегда указывайте `1`. Чтобы добавить изображение к уже загруженным, номер медиафайла должен…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * uploadfile - ДвоичныеДанные
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3MediaFile(Знач XNmId, Знач XPhotoNumber, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Nm-Id", XNmId);
	Заголовки.Вставить("X-Photo-Number", XPhotoNumber);

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v3/media/file",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://content-api.wildberries.ru");

КонецФункции

// Загрузить медиафайлы по ссылкам
//
// Метод загружает набор медиафайлов в карточку товара через указание ссылок в запросе.
//
// Новые медиафайлы полностью заменяют старые. Чтобы добавить новые медиафайлы, укажите в запросе ссылки одновременно на новые и старые медиафайлы.
//
// Требования к ссылкам:
// \\* для доступа к файлу по ссылке не нужна авторизация
// \\* ссылка ведёт прямо на файл. Убедитесь, что ссылка не ведёт на страницу предпросмотра или авторизации. Ссылка должна заканчиваться на имя файла с расширением — например, `/file\\_name.jpg`. Если по ссылке открывается текстовая страница TXT или HTML, ссылка считается некорректной.
// Помните, что некоторые хранилища не формируют прямые ссылки и поэтому не подходят для использования. К таким хранилищам относится, например, \\*\\*Google Drive\\*\\*, который формирует ссылки только на предпросмотр файла либо на служебные страницы.
// Требования к изображениям:
// \\* максимум изображений для одной карточки товара — 30
// \\* минимальное разрешение — 700×900 px
// \\* максимальный размер — 32 Мб
// \\* минимальное качество — 65%
// \\* форматы — JPG, PNG, BMP, GIF (статичные), WebP
// Требования к видео:
// \\* максимум одно видео для одной карточки товара
// \\* максимальный размер — 50 Мб
// \\* форматы — MOV, MP4
// Если видео или хотя бы одно изображение в запросе не соответствует требованиям, то даже при успешном ответе (`200`) ни одно изображение/видео не загрузится.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов **Медиафайлов**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Сервисный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsPostV3MediaSaveRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV3MediaSave(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v3/media/save",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

