// ЦеныИСкидкиApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ЦеныИСкидкиApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Детализация необработанной загрузки
//
// Метод возвращает информацию о товарах и ошибках в товарах из загрузки в обработке.
//
// Необработанная загрузка — это загрузка скидок в [календаре акций](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar). Такие скидки применятся к товарам только в момент старта акции.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   limit - Число - Сколько элементов вывести на одной странице (пагинация)
//   uploadID - Число - ID загрузки
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнется с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2BufferGoodsTask(Знач limit, Знач uploadID, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("limit", limit);
	ПараметрыЗапроса.Вставить("uploadID", uploadID);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v2/buffer/goods/task",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Состояние необработанной загрузки
//
// Метод возвращает информацию про загрузку скидок в обработке.
//
// Необработанная загрузка — это загрузка скидок в [календаре акций](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar). Такие скидки применятся к товарам только в момент старта акции.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   uploadID - Число - ID загрузки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2BufferTasks(Знач uploadID) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("uploadID", uploadID);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v2/buffer/tasks",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Детализация обработанной загрузки
//
// Метод возвращает информацию о товарах и об ошибках в товарах в обработанной загрузке.
//
// Обработанная загрузка — это загрузка цен и скидок для [товаров](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTask), цен для [размеров товаров](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskSize) [скидок WB Клуба](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskClubDiscount) и [оптовых скидок для B2B-продаж](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV1UploadTaskB2bWholesale).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   limit - Число - Сколько элементов вывести на одной странице (пагинация)
//   uploadID - Число - ID загрузки
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнется с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2HistoryGoodsTask(Знач limit, Знач uploadID, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("limit", limit);
	ПараметрыЗапроса.Вставить("uploadID", uploadID);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v2/history/goods/task",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Состояние обработанной загрузки
//
// Метод возвращает информацию об обработанной загрузке цен и скидок.
//
// Обработанная загрузка — это загрузка цен и скидок для [товаров](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTask), цен для [размеров товаров](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskSize), [скидок WB Клуба](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskClubDiscount) и [оптовых скидок для B2B-продаж](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV1UploadTaskB2bWholesale).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   uploadID - Число - ID загрузки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2HistoryTasks(Знач uploadID) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("uploadID", uploadID);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v2/history/tasks",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Получить товары с ценами
//
// Метод возвращает информацию о товарах: цены, валюту, общие скидки, [скидки WB Клуба](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskClubDiscount) и [оптовые скидки для B2B-продаж](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV1UploadTaskB2bWholesale).
//
// В одном запросе можно указать только один артикул.
//
// Чтобы получить информацию обо всех товарах продавца, не указывая артикулы, установите `limit=1000`, в параметре `offset` установите смещение по количеству записей. Количество нужно рассчитать по формуле: `offset` плюс `limit` из предыдущего запроса. Повторяйте запрос, пока вы не получите ответ с пустым массивом.
//
// Используйте отдельные методы, чтобы получить информацию:
// - о [нескольких товарах по артикулам](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2ListGoodsFilter)
// - о [размерах товара](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2ListGoodsSizeNm)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   limit - Число - Сколько элементов вывести на одной странице (пагинация)
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнется с 11 элемента
//    * filterNmID - Число - Артикул WB для поиска товара
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2ListGoodsFilter(Знач limit, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("limit", limit);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v2/list/goods/filter",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Получить размеры товара с ценами
//
// Метод возвращает информацию обо всех размерах одного товара: цены, валюту, общие скидки и скидки для [WB Клуба](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskClubDiscount).
//
// Работает только для товаров из категорий, где можно устанавливать цены отдельно для разных размеров. Для таких товаров `\"editableSizePrice\":true`.
//
// Чтобы получить информацию о самом товаре, используйте [отдельный метод](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2ListGoodsFilter).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   limit - Число - Сколько элементов вывести на одной странице (пагинация)
//   nmID - Число - Артикул WB
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнется с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2ListGoodsSizeNm(Знач limit, Знач nmID, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("limit", limit);
	ПараметрыЗапроса.Вставить("nmID", nmID);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v2/list/goods/size/nm",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Получить товары в карантине
//
// Метод возвращает информацию о товарах в карантине.
//
// Если новая цена товара со скидкой будет меньше [порогового значения](https://seller.wildberries.ru/instructions/ru/ru/material/price-quarantine#2ef3641a-5165-41db-9ac7-e4374c9fc3f1), товар попадёт в [карантин](https://seller.wildberries.ru/instructions/ru/ru/material/price-quarantine) и будет продаваться по старой цене. Ошибка об этом будет в [детализации загрузки](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryGoodsTask).
//
// Вы можете изменить цену или скидку с помощью API либо вывести товар из карантина в [личном кабинете](https://seller.wildberries.ru/discount-and-prices/quarantine).
//
// Для товаров с [поразмерной установкой цен](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskSize) карантин не применяется.
//
// В [песочнице](https://dev.wildberries.ru/sandbox) товары автоматически удаляются из карантина через 3 дня.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   limit - Число - Сколько элементов вывести на одной странице (пагинация)
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнется с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2QuarantineGoods(Знач limit, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("limit", limit);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v2/quarantine/goods",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Установить оптовые скидки для B2B-продаж
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод устанавливает [оптовые скидки для бизнеса](https://seller.wildberries.ru/instructions/ru/ru/material/how-to-enable-wholesale-discounts-for-business)
//
// Получить информацию о процессе установки цен и скидок можно с помощью методов [состояния](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryTasks) и [детализации](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryGoodsTask) обработанной загрузки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
//
// Параметры:
//   Тело - ItemsPostV1UploadTaskB2bWholesaleRequest - Установка оптовых скидок для B2B
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1UploadTaskB2bWholesale(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/discounts-prices/v1/upload/task/b2b/wholesale",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Получить товары с ценами по артикулам
//
// Метод возвращает информацию о товарах по их артикулам: цены, валюту, общие скидки, [скидки WB Клуба](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskClubDiscount) и [оптовые скидки для B2B-продаж](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV1UploadTaskB2bWholesale).
//
// В одном запросе можно указать более одного артикула.
//
// Используйте отдельные методы, чтобы получить информацию:
// - обо [всех товарах продавца, не указывая артикулы](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2ListGoodsFilter)
// - о [размерах товара](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2ListGoodsSizeNm)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsPostV2ListGoodsFilterRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2ListGoodsFilter(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/list/goods/filter",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Установить цены и скидки
//
// Метод устанавливает цены и скидки для товаров.
//
// Чтобы установить цены для размеров товара, используйте [отдельный метод](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTaskSize).
//
// Получить информацию о процессе установки цен и скидок можно с помощью методов [состояния](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryTasks) и [детализации](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryGoodsTask) обработанной загрузки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsPostV2UploadTaskRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2UploadTask(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/upload/task",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Установить скидки WB Клуба
//
// Устанавливает скидки для товаров в рамках подписки [WB Клуб](https://seller.wildberries.ru/help-center/article/A-337).
//
// Получить информацию о процессе установки цен и скидок можно с помощью методов [состояния](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryTasks) и [детализации](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryGoodsTask) обработанной загрузки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsPostV2UploadTaskClubDiscountRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2UploadTaskClubDiscount(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/upload/task/club-discount",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

// Установить цены для размеров
//
// Метод устанавливает цены отдельно для размеров товаров.
// Работает только для товаров из категорий, где можно устанавливать цены отдельно для разных размеров. Для [таких товаров](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2ListGoodsSizeNm) `\"editableSizePrice\":true`.
// Чтобы установить цены и скидки для самих товаров, используйте [отдельный метод](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/postV2UploadTask).
//
// Получить информацию о процессе установки цен и скидок можно с помощью методов [состояния](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryTasks) и [детализации](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryGoodsTask) обработанной загрузки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Цены и скидки**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsPostV2UploadTaskSizeRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2UploadTaskSize(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v2/upload/task/size",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://discounts-prices-api.wildberries.ru");

КонецФункции

