// ЯрлыкиApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ЯрлыкиApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Удаление ярлыка
//
// Метод удаляет ярлык из [списка ярлыков](https://dev.wildberries.ru/openapi/item-management#tag/labels/operation/getV2Tags) продавца.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов **Ярлыков**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Сервисный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   id - Число - Числовой ID ярлыка
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV2TagId(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		СтрШаблон("/content/v2/tag/%1", Транспорт.ЭкранироватьСегмент(id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://content-api.wildberries.ru");

КонецФункции

// Список ярлыков
//
// Метод возвращает список и характеристики всех ярлыков продавца для группировки и фильтрации товаров.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов **Ярлыков**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Сервисный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2Tags() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/content/v2/tags",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://content-api.wildberries.ru");

КонецФункции

// Изменение ярлыка
//
// Метод заменяет данные ярлыка: имя и цвет.
//
// Новые данные можно получить в общем [списке](https://dev.wildberries.ru/openapi/item-management#tag/labels/operation/getV2Tags).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов **Ярлыков**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Сервисный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   id - Число - Числовой ID ярлыка
//   Тело - ItemsPatchV2TagIdRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV2TagId(Знач id, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		СтрШаблон("/content/v2/tag/%1", Транспорт.ЭкранироватьСегмент(id)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

// Создание ярлыка
//
// Метод добавляет один ярлык продавца. Можно создать максимум 15 ярлыков для одного продавца. Максимальная длина ярлыка — 15 символов.
//
// Созданный ярлык можно получить в общем [списке](https://dev.wildberries.ru/openapi/item-management#tag/labels/operation/getV2Tags).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов **Ярлыков**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Сервисный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsPostV2TagRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2Tag(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v2/tag",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

// Управление ярлыками в карточке товара
//
// Метод добавляет или снимает ярлык с карточки товара. К карточке можно добавить максимум 15 ярлыков.
// При удалении ярлыка из карточки товара он не удаляется из [списка ярлыков](https://dev.wildberries.ru/openapi/item-management#tag/labels/operation/getV2Tags) продавца.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов **Ярлыков**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Сервисный | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 1 мин | 100 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// ---
//
// В [песочнице](https://dev.wildberries.ru/sandbox) — максимум 1 запрос в секунду суммарно для всех методов **Контента**.
//
// Параметры:
//   Тело - ItemsPostV2TagNomenclatureLinkRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2TagNomenclatureLink(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/content/v2/tag/nomenclature/link",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://content-api.wildberries.ru");

КонецФункции

