// ВозвратыПокупателямиApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ВозвратыПокупателямиApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Заявки покупателей на возврат
//
// Метод возвращает заявки покупателей на возврат товаров за последние 14 дней. Вы можете [отвечать на эти заявки](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersReturns/operation/patchV1Claim).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Сервисный | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   is_archive - Булево - Состояние заявки: * `false` — на рассмотрении * `true` — в архиве
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * id - Строка - ID заявки
//    * limit - Число - Количество заявок в ответе
//    * offset - Число - После какого элемента выдавать данные
//    * nm_id - Число - Артикул WB
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Claims(Знач is_archive, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("is_archive", is_archive);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/claims",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://returns-api.wildberries.ru");

КонецФункции

// Ответ на заявку покупателя
//
// Метод отправляет ответ на [заявку](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersReturns/operation/getV1Claims) покупателя на возврат товаров.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Сервисный | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - CommunicationsPatchV1ClaimRequest - Ответ на заявку
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV1Claim(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/v1/claim",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://returns-api.wildberries.ru");

КонецФункции

