// ВопросыApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ВопросыApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Непросмотренные отзывы и вопросы
//
// Метод проверяет наличие непросмотренных [вопросов](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) и [отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) от покупателей. Если у продавца есть непросмотренные вопросы или отзывы, возвращает `true`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1NewFeedbacksQuestions() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/new-feedbacks-questions",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Получить вопрос по ID
//
// Метод возвращает данные [вопроса](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) по его ID. Далее вы можете [работать с этим вопросом](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/patchV1Questions).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Строка - ID вопроса
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Question(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/question",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Список вопросов
//
// Метод возвращает список вопросов по заданным фильтрам. Вы можете:
// - получить данные отвеченных и неотвеченных вопросов
// - сортировать вопросы по дате
// - настроить пагинацию и количество вопросов в ответе
//
// Можно получить максимум 10 000 вопросов в одном ответе
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   isAnswered - Булево - Есть ли ответ на вопрос: - `true` — да - `false` — нет
//   take - Число - Количество запрашиваемых вопросов (максимально допустимое значение для параметра - 10 000, при этом сумма значений параметров `take` и `skip` не должна превышат…
//   skip - Число - Количество вопросов для пропуска (максимально допустимое значение для параметра - 10 000, при этом сумма значений параметров `take` и `skip` не должна превышать…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * nmId - Число - Артикул WB
//    * order - Строка - Сортировка вопросов по дате (`dateAsc`/`dateDesc`)
//    * dateFrom - Число - Дата начала периода в формате Unix timestamp
//    * dateTo - Число - Дата конца периода в формате Unix timestamp
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Questions(Знач isAnswered, Знач take, Знач skip, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("isAnswered", isAnswered);
	ПараметрыЗапроса.Вставить("take", take);
	ПараметрыЗапроса.Вставить("skip", skip);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/questions",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Количество вопросов
//
// Метод возвращает количество отвеченных или неотвеченных [вопросов](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) за заданный период.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Число - Дата начала периода в формате Unix timestamp
//    * dateTo - Число - Дата конца периода в формате Unix timestamp
//    * isAnswered - Булево - Есть ли ответ на вопрос: - `true` — да - `false` — нет
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1QuestionsCount(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/questions/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Неотвеченные вопросы
//
// Метод возвращает общее количество неотвеченных [вопросов](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) и количество неотвеченных вопросов за сегодня.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1QuestionsCountUnanswered() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/questions/count-unanswered",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Работа с вопросами
//
// В зависимости от тела запроса, метод позволяет:
// - отметить [вопрос](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) как просмотренный
// - отклонить вопрос
// - ответить на вопрос или отредактировать ответ
//
// Все ответы продавцов проходят предварительную модерацию перед публикацией
//
// Отредактировать ответ на вопрос можно 1 раз в течение 60 дней после отправки ответа
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - CommunicationsPatchV1QuestionsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV1Questions(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/v1/questions",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

