// ЗакреплённыеОтзывыApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ЗакреплённыеОтзывыApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Открепить отзывы
//
// Метод позволяет открепить отзывы в карточке товара или в группе [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-kartochek-tovarov) карточек.
// Чтобы получить `pinId` — ID операций закрепления, используйте метод [Список закреплённых и откреплённых отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/pinnedFeedbacks/operation/getFeedbacksV1Pins).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - Массив - Список `pinId` — ID операций закрепления отзывов
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteFeedbacksV1Pins(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		"/api/feedbacks/v1/pins",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Список закреплённых и откреплённых отзывов
//
// Метод предоставляет список закреплённых и откреплённых отзывов.
//
// Откреплёнными считаются только отзывы, которые были откреплены автоматически по причинам, указанным в ответе в поле `unpinnedCause`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * state - Строка - Закреплён ли отзыв: - `pinned` — да - `unpinned` — нет
//    * pinOn - Строка - Место закрепления отзыва: - `nm` — карточка товара - `imt` — группа [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8b…
//    * imtId - Число - ID для [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-karto…
//    * nmId - Число - Артикул WB
//    * feedbackId - Число - ID отзыва
//    * dateFrom - Дата - Дата закрепления первого отзыва в списке
//    * dateTo - Дата - Дата закрепления последнего отзыва в списке
//    * next - Число - ID последней операции закрепления (пагинатор)
//    * limit - Число - Количество отзывов на одной странице (пагинация)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetFeedbacksV1Pins(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/feedbacks/v1/pins",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Количество закреплённых и откреплённых отзывов
//
// Метод возвращает количество закреплённых и откреплённых отзывов за заданный период.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * state - Строка - Закреплён ли отзыв: - `pinned` — да - `unpinned` — нет
//    * pinOn - Строка - Место закрепления отзыва: - `nm` — карточка товара - `imt` — группа [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8b…
//    * imtId - Число - ID для [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-karto…
//    * nmId - Число - Артикул WB
//    * feedbackId - Число - ID отзыва
//    * dateFrom - Дата - Дата закрепления первого отзыва в списке
//    * dateTo - Дата - Дата закрепления последнего отзыва в списке
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetFeedbacksV1PinsCount(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/feedbacks/v1/pins/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Лимиты закреплённых отзывов
//
// Метод возвращает лимиты закреплённых отзывов по тарифу и подписке.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetFeedbacksV1PinsLimits() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/feedbacks/v1/pins/limits",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Закрепить отзывы
//
// Метод позволяет закрепить отзывы в карточке товара или в группе [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-kartochek-tovarov) карточек.
// Чтобы получить ID отзывов, используйте метод [Список закреплённых и откреплённых отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/pinnedFeedbacks/operation/getFeedbacksV1Pins).
//
// Метод доступен по [подписке Джем](https://seller.wildberries.ru/monetization/jam) или c [тарифной опцией](https://seller.wildberries.ru/tariff-constructor) \\*\\*Закрепление отзыва\\*\\*.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - Массив
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostFeedbacksV1Pins(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/feedbacks/v1/pins",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

