// ОтзывыApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ОтзывыApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Получить отзыв по ID
//
// Метод возвращает данные [отзыва](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) по его ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Строка - ID отзыва
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Feedback(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedback",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Список отзывов
//
// Метод возвращает список отзывов по заданным фильтрам. Вы можете:
// - получить данные обработанных и необработанных отзывов.
// Отзыв считается обработанным, если выполняется одно из условий:
// - на отзыв получен ответ
// - отзыв содержит только оценку (без текста и фото)
// - сортировать отзывы по дате
// - настроить пагинацию и количество отзывов в ответе
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   isAnswered - Булево - Вернуть только обработанные отзывы: - `true` — да - `false` — нет
//   take - Число - Количество отзывов (max. 5 000)
//   skip - Число - Количество отзывов для пропуска (max. 199990)
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * nmId - Число - Артикул WB
//    * order - Строка - Сортировка отзывов по дате (dateAsc/dateDesc)
//    * dateFrom - Число - Дата начала периода в формате Unix timestamp
//    * dateTo - Число - Дата конца периода в формате Unix timestamp
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Feedbacks(Знач isAnswered, Знач take, Знач skip, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("isAnswered", isAnswered);
	ПараметрыЗапроса.Вставить("take", take);
	ПараметрыЗапроса.Вставить("skip", skip);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedbacks",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Список архивных отзывов
//
// Метод возвращает список архивных [отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks).
//
// Отзыв становится архивным, если:
// - на отзыв получен ответ
// - на отзыв не получен ответ в течение 30 дней
// - в отзыве нет текста и фото
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   take - Число - Количество отзывов (max. 5 000)
//   skip - Число - Количество отзывов для пропуска
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * nmId - Число - Артикул WB
//    * order - Строка - Сортировка отзывов по дате (dateAsc/dateDesc)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1FeedbacksArchive(Знач take, Знач skip, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("take", take);
	ПараметрыЗапроса.Вставить("skip", skip);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedbacks/archive",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Количество отзывов
//
// Метод возвращает количество обработанных или необработанных [отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) за заданный период.
// Отзыв считается обработанным, если выполняется одно из условий:
// - на отзыв получен ответ
// - отзыв содержит только оценку (без текста и фото)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   isAnswered - Булево - Вернуть только обработанные отзывы: - `true` — да - `false` — нет
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Число - Дата начала периода в формате Unix timestamp
//    * dateTo - Число - Дата конца периода в формате Unix timestamp
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1FeedbacksCount(Знач isAnswered, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("isAnswered", isAnswered);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedbacks/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Необработанные отзывы
//
// Метод возвращает:
// - количество необработанных [отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) за сегодня и за всё время
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1FeedbacksCountUnanswered() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedbacks/count-unanswered",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Отредактировать ответ на отзыв
//
// Метод позволяет отредактировать уже отправленный [ответ на отзыв](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/postV1FeedbacksAnswer) покупателя.
//
// Отредактировать ответ можно только один раз в течение 60 дней c момента отправки.
//
// ID отзыва не валидируется. Если в запросе вы передали некорректный ID, вы не получите ошибку.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - CommunicationsPatchV1FeedbacksAnswerRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV1FeedbacksAnswer(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/v1/feedbacks/answer",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Ответить на отзыв
//
// Метод позволяет ответить на [отзыв](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) покупателя.
//
// ID отзыва не валидируется. Если в запросе вы передали некорректный ID, вы не получите ошибку.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - CommunicationsPostV1FeedbacksAnswerRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1FeedbacksAnswer(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/feedbacks/answer",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Возврат товара по ID отзыва
//
// Метод запрашивает возврат товара, по которому оставлен [отзыв](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks).
//
// Возврат доступен для отзывов с полем `\"isAbleReturnProductOrders\": true`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - CommunicationsPostV1FeedbacksOrderReturnRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1FeedbacksOrderReturn(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/feedbacks/order/return",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

