// ЧатСПокупателямиApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ЧатСПокупателямиApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Список чатов
//
// Метод возвращает список всех чатов продавца. По этим данным можно получить [события чатов](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersChat/operation/getV1SellerEvents) или [отправить сообщение покупателю](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersChat/operation/postV1SellerMessage).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Сервисный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый с секретом | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SellerChats() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/seller/chats",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://buyer-chat-api.wildberries.ru");

КонецФункции

// Получить файл из сообщения
//
// Метод возвращает файл или изображение из сообщения по его ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Сервисный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый с секретом | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый | 1 ч | 10 запросов | 6 мин | 1 запрос |
//
// Параметры:
//   id - Строка - ID файла, см. значение поля `downloadID` в методе [События чатов](./customer-communication#tag/buyersChat/operation/getV1SellerEvents)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SellerDownloadId(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/seller/download/%1", Транспорт.ЭкранироватьСегмент(id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://buyer-chat-api.wildberries.ru");

КонецФункции

// События чатов
//
// Метод возвращает список событий всех [чатов с покупателями](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersChat/operation/getV1SellerChats).
// Чтобы получить все события:
// 1. Сделайте первый запрос без параметра `next`.
// 2. Повторяйте запрос со значением параметра `next` из ответа на предыдущий запрос, пока `totalEvents` не станет равным `0`. Это будет означать, что вы получили все события.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Сервисный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый с секретом | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * next - Число - Пагинатор. С какого момента получить следующий пакет данных. Формат Unix timestamp \\*\\*с миллисекундами\\*\\*
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SellerEvents(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/seller/events",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://buyer-chat-api.wildberries.ru");

КонецФункции

// Отправить сообщение
//
// Метод отправляет сообщения в [чат с покупателем](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersChat/operation/getV1SellerChats).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Сервисный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый с секретом | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   replySign - Строка - Подпись чата. Можно получить из [информации по чату](./customer-communication#tag/buyersChat/operation/getV1SellerChats) или [данных события](./customer-communi…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * message - Строка - Текст сообщения. Максимум 1000 символов.
//    * file - Массив - Файлы, формат JPEG, PDF или PNG, максимальный размер — 5 Мб каждый. Максимальный суммарный размер файлов — 30 Мб.
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1SellerMessage(Знач replySign, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/seller/message",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://buyer-chat-api.wildberries.ru");

КонецФункции

