// УправлениеПользователямиПродавцаApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый УправлениеПользователямиПродавцаApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Удалить пользователя
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену
//
// Метод удаляет пользователя из [списка сотрудников продавца](https://dev.wildberries.ru/openapi/api-information#tag/sellerUserManagement/operation/getV1Users). Этому пользователю будет закрыт доступ в профиль продавца.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 сек | 1 запрос | 1 сек | 10 запросов |
//
// Параметры:
//   deletedUserID - Число - ID пользователя, которому будет закрыт доступ
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV1User(Знач deletedUserID) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("deletedUserID", deletedUserID);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		"/api/v1/user",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://user-management-api.wildberries.ru");

КонецФункции

// Получить список активных или приглашённых пользователей продавца
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену
//
// Метод возвращает список активных или приглашённых пользователей профиля продавца.
//
// Чтобы выбрать список, укажите значение параметра `isInviteOnly`:
// - `isInviteOnly=true` — список приглашённых пользователей, которые ещё не активировали доступ
// - `isInviteOnly=false` или не указан — список активных пользователей
// По каждому пользователю можно получить:
// - роль пользователя
// - разделы, к которым есть доступы
// - статус приглашения
// Список приглашённых пользователей в ответе всегда отсортирован по дате создания: от новых до старых.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 сек | 1 запрос | 1 сек | 5 запросов |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество активных или приглашённых пользователей в ответе
//    * offset - Число - Сколько элементов пропустить. Например, для значения 10 ответ начнется с 11 элемента
//    * isInviteOnly - Булево - - `true` — список приглашённых пользователей, которые ещё не активировали доступ - `false` или не указан — список активных пользователей профиля продавца
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Users(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/users",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://user-management-api.wildberries.ru");

КонецФункции

// Создать приглашение для нового пользователя
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену
//
// Метод создаёт приглашение для нового пользователя с настройкой доступов к разделам профиля продавца.
// Как выдаются права доступа:
// - Если `access` пустой (`[]`) или не указан — по умолчанию выдаются все доступы, кроме доступов к витрине (`showcase`) и \\*\\*Джем\\*\\* (`changeJam`)
// - Если в `access` указана часть разделов профиля, то кроме тех доступов, что указаны в запросе, также выдаются все доступы по умолчанию
// - Если в `access` перечислены все возможные разделы, доступы будут выданы согласно запросу, без доступов по умолчанию
// - Если в `access` дважды указан один и тот же раздел (`code`):
// - при разных значениях `disabled` (`true` и `false`) доступ не будет выдан
// - при одинаковых значениях `\"disabled\": true` доступ не будет выдан
// - при одинаковых значениях `\"disabled\": false` доступ будет выдан
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 сек | 1 запрос | 1 сек | 5 запросов |
//
// Параметры:
//   Тело - GeneralCreateInviteRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1Invite(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/invite",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://user-management-api.wildberries.ru");

КонецФункции

// Изменить права доступа пользователей
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену
//
// Метод меняет права доступа одному или нескольким пользователям.
//
// Обновляются только права доступа, переданные в параметрах запроса. Остальные поля остаются без изменений.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 сек | 1 запрос | 1 сек | 5 запросов |
//
// Параметры:
//   Тело - GeneralUpdateUserAccessRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PutV1UsersAccess(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PUT",
		"/api/v1/users/access",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://user-management-api.wildberries.ru");

КонецФункции

