// ДоляБрендаВПродажахApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ДоляБрендаВПродажахApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Получить отчёт
//
// Метод возвращает отчёт о [доле бренда продавца в продажах](https://seller.wildberries.ru/analytics-reports/brand-share).
//
// Можно получить отчёт максимум за 365 дней. Данные доступны с 1 ноября 2022.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Сервисный | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Базовый с секретом | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   parentId - Число - ID родительской категории
//   brand - Строка - Бренд
//   dateFrom - Строка - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Строка - Конец отчётного периода, `ГГГГ-ММ-ДД`
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsBrandShare(Знач parentId, Знач brand, Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("parentId", parentId);
	ПараметрыЗапроса.Вставить("brand", brand);
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/brand-share",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Бренды продавца
//
// Метод возвращает список брендов продавца для отчёта о [доле бренда в продажах](https://seller.wildberries.ru/analytics-reports/brand-share).
//
// Можно получить только бренды, которые:
// - Продавались за последние 90 дней
// - Есть в наличии, вне зависимости от склада хранения
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsBrandShareBrands() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/brand-share/brands",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Родительские категории бренда
//
// Метод возвращает родительские категории бренда продавца для отчёта о [доле бренда в продажах](https://seller.wildberries.ru/analytics-reports/brand-share).
//
// Можно получить отчёт максимум за 365 дней. Данные доступны с 1 ноября 2022.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Сервисный | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Базовый с секретом | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   brand - Строка - Бренд
//   dateFrom - Строка - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Строка - Конец отчётного периода, `ГГГГ-ММ-ДД`
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * locale - Строка - Язык поля ответа `parentName`: - `ru` — русский - `en` — английский - `zh` — китайский
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsBrandShareParentSubjects(Знач brand, Знач dateFrom, Знач dateTo, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("brand", brand);
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/brand-share/parent-subjects",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

