// ОсновныеОтчётыApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ОсновныеОтчётыApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Заказы
//
// Метод возвращает информацию о заказах.
// Данные обновляются раз в 30 минут.
//
// 1 строка = 1 заказ = 1 сборочное задание = 1 единица товара.
// Для определения заказа рекомендуем использовать поле `srid`.
//
// Информация о заказе хранится 90 дней с момента оформления.
//
// В ответах могут отсутствовать заказы, по которым не подтверждена оплата. Например, заказы с отложенными платежами или оплатой в рассрочку. При этом, если по таким заказам есть продажи, вы можете получить их с помощью [детализаций к отчётам реализации](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/financialReports).
// Чтобы получить все оформленные заказы, используйте [Ленту заказов](https://dev.wildberries.ru/openapi/analytics#tag/orderFeed).
//
// Данные этого отчёта являются предварительными и служат для оперативного мониторинга
//
// Для одного ответа на запрос с `flag=0` или без `flag` в системе установлено условное ограничение 80000 строк. Поэтому, чтобы получить все заказы, может потребоваться более, чем один запрос. Во втором и далее запросе в параметре `dateFrom` используйте полное значение поля `lastChangeDate` из последней строки ответа на предыдущий запрос.
// Если в ответе отдаётся пустой массив `[]`, все заказы уже выгружены.
//
// В песочнице для параметров `dateFrom` и `dateTo` можно задать диапазон только за последние 4 месяца от текущей даты.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый | 3 ч | 1 запрос | 3 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Дата и время последнего изменения по заказу. Дата в формате RFC3339. Можно передать дату или дату со временем. Время можно указывать с точностью до [секунд](./a…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * flag - Число - Если параметр `flag=0` (или не указан в строке запроса), при вызове API возвращаются данные, у которых значение поля `lastChangeDate` (дата время обновления инф…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SupplierOrders(Знач dateFrom, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/supplier/orders",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://statistics-api.wildberries.ru");

КонецФункции

// Продажи
//
// Метод возвращает информацию о продажах и возвратах.
// Данные обновляются раз в 30 минут.
//
// 1 строка = 1 заказ = 1 сборочное задание = 1 единица товара.
// Для определения заказа рекомендуем использовать поле `srid`.
//
// Информация о заказе хранится 90 дней с момента оформления.
//
// Данные этого отчёта являются предварительными и служат для оперативного мониторинга
//
// - В ответах могут отсутствовать заказы, по которым не подтверждена оплата, даже если эти заказы есть в детализациях к отчётам реализации. Например, заказы с отложенными платежами или оплатой в рассрочку
// - Значения полей `priceWithDisc` и `forPay` рассчитываются по упрощённой логике и могут отличаться от `retail\\_price\\_withdisc\\_rub` и `ppvz\\_for\\_pay` соответственно в детализациях к отчётам реализации
// - Поля `finishedPrice`, `priceWithDisc`, `forPay` могут временно иметь значение `0`: данные заполняются асинхронно, актуализируются в течение 24 часов
// - Для заказов, которые оплачены в валюте, отличной от валюты продавца, возможны округления цен из-за конвертации валют
// Для точных финансовых расчётов, сверки и отчётности используйте [детализации к отчётам реализации](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/financialReports).
//
// Для одного ответа на запрос с `flag=0` или без `flag` в системе установлено условное ограничение 80000 строк. Поэтому, чтобы получить все продажи и возвраты, может потребоваться более, чем один запрос. Во втором и далее запросе в параметре `dateFrom `используйте полное значение поля `lastChangeDate` из последней строки ответа на предыдущий запрос.
// Если в ответе отдаётся пустой массив `[]`, все продажи и возвраты уже выгружены.
//
// В песочнице для параметров `dateFrom` и `dateTo` можно задать диапазон только за последние 4 месяца от текущей даты.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 2 ч | 1 запрос | 2 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Дата и время последнего изменения по продаже/возврату. Дата в формате RFC3339. Можно передать дату или дату со временем. Время можно указывать с точностью до [с…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * flag - Число - Если параметр `flag=0` (или не указан в строке запроса), при вызове API возвращаются данные, у которых значение поля `lastChangeDate` (дата время обновления инф…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SupplierSales(Знач dateFrom, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/supplier/sales",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://statistics-api.wildberries.ru");

КонецФункции

