// ОтчётОТоварахCОбязательнойМаркировкойApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ОтчётОТоварахCОбязательнойМаркировкойApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Получить отчёт
//
// Метод возвращает отчёт с [операциями по товарам с обязательной маркировкой](https://seller.wildberries.ru/analytics-reports/excise-report).
//
// Данный отчёт можно сохранить в [формате таблиц](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-650c-7b04-9596-ba441936f9d3).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 ч | 10 запросов | 30 мин | 10 запросов |
// | Сервисный | 5 ч | 10 запросов | 30 мин | 10 запросов |
// | Базовый с секретом | 5 ч | 10 запросов | 30 мин | 10 запросов |
// | Базовый | 24 ч | 2 запроса | 12 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Строка - Конец отчётного периода, `ГГГГ-ММ-ДД`
//   Тело - ReportsExciseReportRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1AnalyticsExciseReport(Знач dateFrom, Знач dateTo, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/analytics/excise-report",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

