// ОтчётыОбУдержанияхApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ОтчётыОбУдержанияхApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Самовыкупы
//
// Метод возвращает отчёт об удержаниях за самовыкупы. Отчёт формируется каждую неделю по средам, до 7:00 по московскому времени, и содержит данные за одну неделю.
//
// Удержание за самовыкуп — 30% от стоимости товаров.
// Минимальная сумма всех удержаний — 100 000 ₽, если за неделю в ПВЗ привезли ваших товаров больше, чем на сумму 100 000 ₽.
//
// Данные доступны с августа 2023.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 мин | 1 запрос | 10 мин | 10 запросов |
// | Сервисный | 10 мин | 1 запрос | 10 мин | 10 запросов |
// | Базовый с секретом | 10 мин | 1 запрос | 10 мин | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * date - Строка - Дата, которая входит в отчётный период, `ГГГГ-ММ-ДД`. Чтобы получить данные за всё время с августа 2023, не указывайте этот параметр
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsAntifraudDetails(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/antifraud-details",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Маркировка товара
//
// Метод возвращает отчёт о штрафах за отсутствие обязательной маркировки товаров.
// В отчёте представлены фотографии товаров, на которых маркировка отсутствует либо не считывается.
//
// Можно получить данные максимум за 31 день. Данные доступны с марта 2024.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Дата - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Дата - Конец отчётного периода, `ГГГГ-ММ-ДД`
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsGoodsLabeling(Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/goods-labeling",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Подмены и неверные вложения
//
// Метод возвращает отчёт об удержаниях за [подмены и неверные вложения](https://seller.wildberries.ru/analytics-reports/dimensions-penalties/retentions)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Параметры:
//   dateTo - Дата - Конец отчётного периода
//   limit - Число - Количество удержаний в ответе
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Дата - Начало отчётного периода. По умолчанию используются дата и время, когда были впервые получены данные для отчёта
//    * sort - Строка - Сортировка: - `nmId` — по артикулу WB - `dtBonus` — по дате и времени удержания - `bonusSumm` — по сумме удержания
//    * order - Строка - Порядок выдачи: - `desc` — по убыванию - `asc` — по возрастанию
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнётся с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Deductions(Знач dateTo, Знач limit, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	ПараметрыЗапроса.Вставить("limit", limit);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/analytics/v1/deductions",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Удержания за занижение габаритов упаковки
//
// Метод возвращает отчёт об [удержаниях за занижение габаритов упаковки](https://seller.wildberries.ru/analytics-reports/dimensions-penalties)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 6 ч | 1 запрос | 6 ч | 1 запрос |
//
// Параметры:
//   dateTo - Дата - Конец отчётного периода
//   limit - Число - Количество удержаний в ответе
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Дата - Начало отчётного периода. По умолчанию используется дата, когда были впервые получены данные для отчёта
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнётся с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1MeasurementPenalties(Знач dateTo, Знач limit, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	ПараметрыЗапроса.Вставить("limit", limit);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/analytics/v1/measurement-penalties",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Замеры склада
//
// Метод возвращает отчёт о [замерах склада](https://seller.wildberries.ru/analytics-reports/dimensions-penalties/warehouse-measurements)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 6 ч | 1 запрос | 6 ч | 1 запрос |
//
// Параметры:
//   dateTo - Дата - Конец отчётного периода
//   limit - Число - Количество замеров в ответе
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Дата - Начало отчётного периода. По умолчанию используется дата, когда были впервые получены данные для отчёта
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнётся с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1WarehouseMeasurements(Знач dateTo, Знач limit, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	ПараметрыЗапроса.Вставить("limit", limit);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/analytics/v1/warehouse-measurements",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

