// ПлатноеХранениеApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ПлатноеХранениеApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Создать отчёт
//
// Метод создаёт [задание на генерацию](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorageTasksTaskIdStatus) отчёта о [платном хранении](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorageTasksTaskIdDownload).
//
// Можно получить отчёт максимум за 8 дней.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 5 запросов |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 5 запросов |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Начало отчётного периода в формате RFC3339. Можно передать дату или дату со временем. Примеры: * `2019-06-20` * `2019-06-20T23:59:59` * `2019-06-20T00:00:00.123…
//   dateTo - Строка - Конец отчётного периода в формате RFC3339. Можно передать дату или дату со временем. Примеры: * `2019-06-20` * `2019-06-20T23:59:59` * `2019-06-20T00:00:00.1234…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PaidStorage(Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/paid_storage",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод возвращает отчёт о [платном хранении](https://seller.wildberries.ru/analytics-reports/paid-storage/storage) по ID [задания на генерацию](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorage).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   task_id - Строка - ID задания на генерацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PaidStorageTasksTaskIdDownload(Знач task_id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/paid_storage/tasks/%1/download", Транспорт.ЭкранироватьСегмент(task_id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Проверить статус
//
// Метод возвращает статус [задания на генерацию](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorage) отчёта о [платном хранении](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorageTasksTaskIdDownload).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 сек | 1 запрос | 5 сек | 5 запросов |
// | Сервисный | 5 сек | 1 запрос | 5 сек | 5 запросов |
// | Базовый с секретом | 5 сек | 1 запрос | 5 сек | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 2 запроса |
//
// Параметры:
//   task_id - Строка - ID задания на генерацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PaidStorageTasksTaskIdStatus(Знач task_id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/paid_storage/tasks/%1/status", Транспорт.ЭкранироватьСегмент(task_id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

